alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint8_t   PLL_LOCK   :  1;               /*!< [0..0] PLL Lock Indicator                                             */
      __IO uint8_t   APCLK_SET  :  1;               /*!< [1..1] Set and Overtake Flag for Clock Settings                       */
      __IO uint8_t   T3CLK_SEL  :  1;               /*!< [2..2] Timer 3 Clock Selection                                        */
      __IO uint8_t   CLKWDT_IE  :  1;               /*!< [3..3] Clock Watchdog Interrupt Enable                                */
      __IO uint8_t   BGCLK_SEL  :  1;               /*!< [4..4] Bandgap Clock Selection                                        */
      __IO uint8_t   BGCLK_DIV  :  1;               /*!< [5..5] Bandgap Clock Divider                                          */
      __IO uint8_t   CPCLK_SEL  :  1;               /*!< [6..6] Charge Pump Clock Selection                                    */
      __IO uint8_t   CPCLK_DIV  :  1;               /*!< [7..7] Charge Pump Clock Divider                                      */
    } bit;                                          /*!< [8] BitSize                                                           */
  } APCLK_CTRL1;
  __I  uint8_t   RESERVED20[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005058) Analog Peripheral Clock Register 1, RESET_TYPE_4       */
    
    struct {
      __IO uint8_t   APCLK1FAC  :  2;               /*!< [0..1] Analog Module Clock Factor                                     */
      __O  uint8_t   APCLK1SCLR :  1;               /*!< [2..2] Analog Peripherals Clock Status Clear                          */
           uint8_t              :  1;
      __I  uint8_t   APCLK1STS  :  2;               /*!< [4..5] Analog Peripherals Clock Status                                */
      __I  uint8_t   APCLK3STS  :  1;               /*!< [6..6] Loss of Clock Status                                           */
      __O  uint8_t   APCLK3SCLR :  1;               /*!< [7..7] Analog Peripherals Clock Status Clear                          */
    } bit;                                          /*!< [8] BitSize                                                           */
  } APCLK1;
  __I  uint8_t   RESERVED21[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000505C) Analog Peripheral Clock Register 2, RESET_TYPE_4       */
    
    struct {
      __IO uint8_t   APCLK2FAC  :  5;               /*!< [0..4] Slow Down Clock Divider for TFILT_CLK Generation               */
      __I  uint8_t   APCLK2STS  :  2;               /*!< [5..6] Analog Peripherals Clock Status                                */
      __O  uint8_t   APCLK2SCLR :  1;               /*!< [7..7] Analog Peripherals Clock Status Clear                          */
    } bit;                                          /*!< [8] BitSize                                                           */
  } APCLK2;
  __I  uint8_t   RESERVED22[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005060) Peripheral Management Control Register 1, RESET_TYPE_3 */
    
    struct {
      __IO uint8_t   ADC1_DIS   :  1;               /*!< [0..0] ADC1 Disable Request. Active high.                             */
      __IO uint8_t   SSC1_DIS   :  1;               /*!< [1..1] SSC1 Disable Request. Active high.                             */
      __IO uint8_t   CCU6_DIS   :  1;               /*!< [2..2] CCU6 Disable Request. Active high.                             */
      __IO uint8_t   T2_DIS     :  1;               /*!< [3..3] T2 Disable Request. Active high.                               */
      __IO uint8_t   GPT12_DIS  :  1;               /*!< [4..4] General Purpose Timer 12 Disable Request. Active high.         */
    } bit;                                          /*!< [5] BitSize                                                           */
  } PMCON1;
  __I  uint8_t   RESERVED23[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005064) Peripheral Management Control Register 2, RESET_TYPE_3 */
    
    struct {
           uint8_t              :  1;
      __IO uint8_t   SSC2_DIS   :  1;               /*!< [1..1] SSC2 Disable Request. Active high.                             */
           uint8_t              :  1;
      __IO uint8_t   T21_DIS    :  1;               /*!< [3..3] T21 Disable Request. Active high.                              */
           uint8_t              :  1;
      __IO uint8_t   T3_DIS     :  1;               /*!< [5..5] T3 Disable Request. Active high.                               */
    } bit;                                          /*!< [6] BitSize                                                           */
  } PMCON2;
  __I  uint8_t   RESERVED24[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005068) Reset Control Register, RESET_TYPE_3                   */
    
    struct {
      __IO uint8_t   LOCKUP     :  1;               /*!< [0..0] Lockup Flag                                                    */
           uint8_t              :  6;
      __IO uint8_t   LOCKUP_EN  :  1;               /*!< [7..7] Lockup Reset Enable Flag                                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } RSTCON;
  __I  uint8_t   RESERVED25[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000506C) Analog Peripheral Clock Control 2 Register, RESET_TYPE_4 */
    
    struct {
           uint8_t              :  2;
      __IO uint8_t   T3CLK_DIV  :  2;               /*!< [2..3] Timer 3 Clock Divider                                          */
    } bit;                                          /*!< [4] BitSize                                                           */
  } APCLK_CTRL2;
  __I  uint8_t   RESERVED26[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005070) System Control Register 0, RESET_TYPE_4                */
    
