alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
           uint8_t              :  4;
      __IO uint8_t   NVMCLKFAC  :  2;               /*!< [4..5] NVM Access Clock Factor                                        */
      __IO uint8_t   SYSCLKSEL  :  2;               /*!< [6..7] System Clock Select                                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SYSCON0;
  __I  uint8_t   RESERVED27[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005074) System Startup Status Register                         */
    
    struct {
      __I  uint8_t   INIT_FAIL  :  1;               /*!< [0..0] Initialization at startup failed                               */
      __I  uint8_t   MRAMINITSTS:  1;               /*!< [1..1] Map RAM Initialization Status                                  */
      __I  uint8_t   PG100TP_CHKS_ERR:  1;          /*!< [2..2] 100 TP Page Checksum Error                                     */
    } bit;                                          /*!< [3] BitSize                                                           */
  } SYS_STRTUP_STS;
  __I  uint8_t   RESERVED28[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005078) Watchdog Timer Reload Register, RESET_TYPE_3           */
    
    struct {
      __IO uint8_t   WDTREL     :  8;               /*!< [0..7] Watchdog Timer Reload Value                                    */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDTREL;
  __I  uint8_t   RESERVED29[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000507C) Watchdog Window-Boundary Count, RESET_TYPE_3           */
    
    struct {
      __IO uint8_t   WDTWINB    :  8;               /*!< [0..7] Watchdog Window-Boundary Count Value                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDTWINB;
  __I  uint8_t   RESERVED30[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005080) Watchdog Timer, Low Byte, RESET_TYPE_3                 */
    
    struct {
      __I  uint8_t   WDT        :  8;               /*!< [0..7] Watchdog Timer Current Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDTL;
  __I  uint8_t   RESERVED31[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005084) Watchdog Timer, High Byte, RESET_TYPE_3                */
    
    struct {
      __I  uint8_t   WDT        :  8;               /*!< [0..7] Watchdog Timer Current Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDTH;
  __I  uint8_t   RESERVED32[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005088) Baud Rate Control Register 1, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   R          :  1;               /*!< [0..0] Baud Rate Generator Run Control Bit                            */
      __IO uint8_t   BRPRE      :  3;               /*!< [1..3] Prescaler Bit                                                  */
    } bit;                                          /*!< [4] BitSize                                                           */
  } BCON1;
  __I  uint8_t   RESERVED33[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000508C) Baud Rate Timer/Reload Register, Low Byte 1,
                                                         RESET_TYPE_3                                                          */
    
    struct {
      __IO uint8_t   FD_SEL     :  5;               /*!< [0..4] Fractional Divider Selection                                   */
      __IO uint8_t   BR_VALUE   :  3;               /*!< [5..7] Baud Rate Timer/Reload Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } BGL1;
  __I  uint8_t   RESERVED34[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005090) Baud Rate Timer/Reload Register, High Byte, RESET_TYPE_3 */
    
    struct {
      __IO uint8_t   BR_VALUE   :  8;               /*!< [0..7] Baud Rate Timer/Reload Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } BGH1;
  __I  uint8_t   RESERVED35[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005094) LIN Status Register, RESET_TYPE_3                      */
    
    struct {
      __IO uint8_t   BRDIS      :  1;               /*!< [0..0] Baud Rate Detection Disable                                    */
      __IO uint8_t   BGSEL      :  2;               /*!< [1..2] Baud Rate Select for Detection                                 */
      __I  uint8_t   BRK        :  1;               /*!< [3..3] Break Field Flag                                               */
      __I  uint8_t   EOFSYN     :  1;               /*!< [4..4] End of SYN Byte Interrupt Flag                                 */
      __I  uint8_t   ERRSYN     :  1;               /*!< [5..5] SYN Byte Error Interrupt Flag                                  */
      __IO uint8_t   SYNEN      :  1;               /*!< [6..6] End of SYN Byte and SYN Byte Error Interrupts Enable           */
    } bit;                                          /*!< [7] BitSize                                                           */
  } LINST;
  __I  uint8_t   RESERVED36[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005098) Baud Rate Control Register 2, RESET_TYPE_3             */
    
