alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
           uint8_t              :  6;
      __IO uint8_t   T2EXCON    :  1;               /*!< [6..6] Timer 2 External Input Control                                 */
      __IO uint8_t   T21EXCON   :  1;               /*!< [7..7] Timer 21 External Input Control                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODPISEL1;
  __I  uint8_t   RESERVED46[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050C0) Peripheral Input Select Register 2, RESET_TYPE_3       */
    
    struct {
      __IO uint8_t   T2IS       :  2;               /*!< [0..1] Timer 2 Input Select                                           */
      __IO uint8_t   T21IS      :  2;               /*!< [2..3] Timer 21 Input Select                                          */
      __IO uint8_t   T2EXIS     :  2;               /*!< [4..5] Timer 2 External Input Select                                  */
      __IO uint8_t   T21EXIS    :  2;               /*!< [6..7] Timer 21 External Input Select                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODPISEL2;
  __I  uint8_t   RESERVED47[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050C4) Peripheral Input Select Register, RESET_TYPE_3         */
    
    struct {
           uint8_t              :  6;
      __IO uint8_t   URIOS2     :  1;               /*!< [6..6] UART2 Input/Output Select                                      */
    } bit;                                          /*!< [7] BitSize                                                           */
  } MODPISEL3;
  __I  uint8_t   RESERVED48[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050C8) Module Suspend Control Register 1, RESET_TYPE_3        */
    
    struct {
      __IO uint8_t   WDTSUSP    :  1;               /*!< [0..0] SCU Watchdog Timer Debug Suspend Bit                           */
      __IO uint8_t   T12SUSP    :  1;               /*!< [1..1] Timer 12 Debug Suspend Bit                                     */
      __IO uint8_t   T13SUSP    :  1;               /*!< [2..2] Timer 13 Debug Suspend Bit                                     */
      __IO uint8_t   T2_SUSP    :  1;               /*!< [3..3] Timer2 Debug Suspend Bit                                       */
      __IO uint8_t   GPT12_SUSP :  1;               /*!< [4..4] GPT12 Debug Suspend Bit                                        */
           uint8_t              :  1;
      __IO uint8_t   T21_SUSP   :  1;               /*!< [6..6] Timer21 Debug Suspend Bit                                      */
    } bit;                                          /*!< [7] BitSize                                                           */
  } MODSUSP1;
  __I  uint8_t   RESERVED49[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050CC) Module Suspend Control Register 2, RESET_TYPE_3        */
    
    struct {
      __IO uint8_t   T3_SUSP    :  1;               /*!< [0..0] Measurement Unit Debug Suspend Bit                             */
      __IO uint8_t   MU_SUSP    :  1;               /*!< [1..1] Measurement Unit Debug Suspend Bit                             */
      __IO uint8_t   ADC1_SUSP  :  1;               /*!< [2..2] ADC1 Unit Debug Suspend Bit                                    */
    } bit;                                          /*!< [3] BitSize                                                           */
  } MODSUSP2;
  __I  uint8_t   RESERVED50[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050D0) GPT12 Peripheral Input Select Register, RESET_TYPE_3   */
    
    struct {
      __IO uint8_t   GPT12      :  4;               /*!< [0..3] GPT12 TIN3B / TIN4D Input Select                               */
      __IO uint8_t   TRIG_CONF  :  1;               /*!< [4..4] CCU6 Trigger Configuration.                                    */
      __IO uint8_t   T3_GPT12_SEL:  1;              /*!< [5..5] CCU6_INT_SEL.                                                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12PISEL;
  __I  uint8_t   RESERVED51[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050D4) Error Detection and Correction Control Register,
                                                         RESET_TYPE_3                                                          */
    
    struct {
      __IO uint8_t   RIE        :  1;               /*!< [0..0] RAM Double Bit ECC Error Interrupt Enable                      */
           uint8_t              :  1;
      __IO uint8_t   NVMIE      :  1;               /*!< [2..2] NVM Double Bit ECC Error Interrupt Enable                      */
    } bit;                                          /*!< [3] BitSize                                                           */
  } EDCCON;
  __I  uint8_t   RESERVED52[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x500050D8) Error Detection and Correction Status Register,
                                                         RESET_TYPE_4                                                          */
    
    struct {
      __I  uint8_t   RDBE       :  1;               /*!< [0..0] RAM Double Bit Error                                           */
           uint8_t              :  1;
      __I  uint8_t   NVMDBE     :  1;               /*!< [2..2] NVM Double Bit Error                                           */
           uint8_t              :  1;
      __I  uint8_t   RSBE       :  1;               /*!< [4..4] RAM Single Bit Error                                           */
    } bit;                                          /*!< [5] BitSize                                                           */
  } EDCSTAT;
  __I  uint8_t   RESERVED53[3];
  
  union {
    __IO uint8_t   reg;                           /*!< (@ 0x500050DC) Memory Status Register                                 */
  
