alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
	  __IO uint8_t   SECTORINFO:  6;              /*!< [0..5] Sector Information                                             */
	  __IO uint8_t   SASTATUS :  2;               /*!< [6..7] Service Algorithm Status                                       */
    } bit0;                                        /*!< [8] BitSize                                                           */
    struct {
      __IO uint8_t   NVMPROP  :  1;               /*!< [0..0] NVM Program Operation Status Bit                               */
      __IO uint8_t   EMPROP   :  1;               /*!< [1..1] Emergency Program Operation Status Bit                         */
    } bit1;                                        /*!< [2] BitSize                                                           */
  } MEMSTAT;
  __I  uint8_t   RESERVED54[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050E0) NVM Protection Status Register, RESET_TYPE_4           */
    
    struct {
      __IO uint8_t   NVMPROTSTSL_0:  1;             /*!< [0..0] NVM Protection Status Register Low Flags                       */
      __IO uint8_t   NVMPROTSTSL_1:  1;             /*!< [1..1] NVM Protection Status Register Low Flags                       */
      __IO uint8_t   NVMPROTSTSL_2:  1;             /*!< [2..2] NVM Protection Status Register Low Flags                       */
      __IO uint8_t   NVMPROTSTSL_3:  1;             /*!< [3..3] NVM Protection Status Register Low Flags                       */
    } bit;                                          /*!< [4] BitSize                                                           */
  } NVM_PROT_STS;
  __I  uint8_t   RESERVED55[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x500050E4) Memory Access Status Register, RESET_TYPE_3            */
    
    struct {
      __I  uint8_t   NVM_PROT_ERR:  1;              /*!< [0..0] NVM Access Protection                                          */
      __I  uint8_t   NVM_ADDR_ERR:  1;              /*!< [1..1] NVM Address Protection                                         */
      __I  uint8_t   NVM_SFR_PROT_ERR:  1;          /*!< [2..2] NVM SFR Access Protection                                      */
      __I  uint8_t   NVM_SFR_ADDR_ERR:  1;          /*!< [3..3] NVM SFR Address Protection                                     */
      __I  uint8_t   ROM_PROT_ERR:  1;              /*!< [4..4] ROM Access Protection                                          */
      __I  uint8_t   ROM_ADDR_ERR:  1;              /*!< [5..5] ROM Address Protection                                         */
      __I  uint8_t   RAM_PROT_ERR:  1;              /*!< [6..6] RAM Access Protection                                          */
      __I  uint8_t   RAM_ADDR_ERR:  1;              /*!< [7..7] RAM Address Protection                                         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MEM_ACC_STS;
  __I  uint8_t   RESERVED56[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050E8) Port Output Control Register, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   PDM0       :  3;               /*!< [0..2] P0.0 Port Driver Mode                                          */
           uint8_t              :  1;
      __IO uint8_t   PDM1       :  3;               /*!< [4..6] P0.1 Port Driver Mode                                          */
    } bit;                                          /*!< [7] BitSize                                                           */
  } P0_POCON0;
  __I  uint8_t   RESERVED57[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050EC) Port Output Control Register, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   PDM2       :  3;               /*!< [0..2] P0.2 Port Driver Mode                                          */
           uint8_t              :  1;
      __IO uint8_t   PDM3       :  3;               /*!< [4..6] P0.3 Port Driver Mode                                          */
    } bit;                                          /*!< [7] BitSize                                                           */
  } P0_POCON1;
  __I  uint8_t   RESERVED58[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050F0) Port Output Control Register, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   PDM4       :  3;               /*!< [0..2] P0.4 Port Driver Mode                                          */
    } bit;                                          /*!< [3] BitSize                                                           */
  } P0_POCON2;
  __I  uint8_t   RESERVED59[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050F4) Temperature Compensation Control Register, RESET_TYPE_3 */
    
    struct {
      __IO uint8_t   TCC        :  2;               /*!< [0..1] Temperature Compensation Control                               */
    } bit;                                          /*!< [2] BitSize                                                           */
  } TCCR;
  __I  uint8_t   RESERVED60[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050F8) Port Output Control Register, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   PDM0       :  3;               /*!< [0..2] P1.0 Port Driver Mode                                          */
           uint8_t              :  1;
      __IO uint8_t   PDM1       :  3;               /*!< [4..6] P1.1 Port Driver Mode                                          */
    } bit;                                          /*!< [7] BitSize                                                           */
  } P1_POCON0;
  __I  uint8_t   RESERVED61[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050FC) Port Output Control Register, RESET_TYPE_3             */
    
