alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 0 Pin 0 Direction Control                                 */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 0 Pin 1 Direction Control                                 */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 0 Pin 2 Direction Control                                 */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 0 Pin 3 Direction Control                                 */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 0 Pin 4 Direction Control                                 */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_DIR;
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028008) Port 1 Data Register                                   */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 1 Pin 0 Data Value                                        */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 1 Pin 1 Data Value                                        */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 1 Pin 2 Data Value                                        */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 1 Pin 3 Data Value                                        */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 1 Pin 4 Data Value                                        */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_DATA;
  __I  uint8_t   RESERVED2[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x4802800C) Port 1 Direction Register                              */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 1 Pin 0 Direction Control                                 */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 1 Pin 1 Direction Control                                 */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 1 Pin 2 Direction Control                                 */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 1 Pin 3 Direction Control                                 */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 1 Pin 4 Direction Control                                 */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_DIR;
  __I  uint8_t   RESERVED3[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x48028010) Port 2 Data Register                                   */
    
    struct {
      __I  uint8_t   P0         :  1;               /*!< [0..0] Port 2 Pin 0 Data Value                                        */
           uint8_t              :  1;
      __I  uint8_t   P2         :  1;               /*!< [2..2] Port 2 Pin 2 Data Value                                        */
      __I  uint8_t   P3         :  1;               /*!< [3..3] Port 2 Pin 3 Data Value                                        */
      __I  uint8_t   P4         :  1;               /*!< [4..4] Port 2 Pin 4 Data Value                                        */
      __I  uint8_t   P5         :  1;               /*!< [5..5] Port 2 Pin 5 Data Value                                        */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P2_DATA;
  __I  uint8_t   RESERVED4[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028014) Port 2 Direction Register                              */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 2 Pin 0 Driver Control                                    */
           uint8_t              :  1;
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 2 Pin 2 Driver Control                                    */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 2 Pin 3 Driver Control                                    */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 2 Pin 4 Driver Control                                    */
      __IO uint8_t   P5         :  1;               /*!< [5..5] Port 2 Pin 5 Driver Control                                    */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P2_DIR;
  __I  uint8_t   RESERVED5[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028018) Port 0 Pull-Up/Pull-Down Select Register               */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 0 Bit 0                          */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Pull-Up/Pull-Down Select Port 0 Bit 1                          */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 0 Bit 2                          */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Select Port 0 Bit 3                          */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 0 Bit 4                          */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_PUDSEL;
  __I  uint8_t   RESERVED6[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x4802801C) Port 0 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 0 Bit 0                       */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Pull-Up/Pull-Down Enable at Port 0 Bit 1                       */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 0 Bit 2                       */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Enable at Port 0 Bit 3                       */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 0 Bit 4                       */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_PUDEN;
  __I  uint8_t   RESERVED7[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028020) Port 1 Pull-Up/Pull-Down Select Register               */
    
