alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint16_t  T6I        :  3;               /*!< [0..2] Timer T6 Input Parameter Selection                             */
      __IO uint16_t  T6M        :  3;               /*!< [3..5] Timer T6 Mode Control (Basic Operating Mode)                   */
      __IO uint16_t  T6R        :  1;               /*!< [6..6] Timer T6 Run Bit                                               */
      __IO uint16_t  T6UD       :  1;               /*!< [7..7] Timer T6 Up/Down Control                                       */
      __IO uint16_t  T6UDE      :  1;               /*!< [8..8] Timer T6 External Up/Down Enable                               */
      __IO uint16_t  T6OE       :  1;               /*!< [9..9] Overflow/Underflow Output Enable                               */
      __IO uint16_t  T6OTL      :  1;               /*!< [10..10] Timer T6 Overflow Toggle Latch                               */
      __IO uint16_t  BPS2       :  2;               /*!< [11..12] GPT2 Block Prescaler Control                                 */
           uint16_t             :  1;
      __IO uint16_t  T6CLR      :  1;               /*!< [14..14] Timer T6 Clear Enable Bit                                    */
      __IO uint16_t  T6SR       :  1;               /*!< [15..15] Timer T6 Reload Mode Enable                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T6CON;
  __I  uint16_t  RESERVED6;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4001001C) Capture/Reload Register                                */
    
    struct {
      __IO uint16_t  CAPREL     : 16;               /*!< [0..15] Current reload value or Captured value                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CAPREL;
  __I  uint16_t  RESERVED7;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010020) Timer T2 Count Register                                */
    
    struct {
      __IO uint16_t  T2         : 16;               /*!< [0..15] Timer T2 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T2;
  __I  uint16_t  RESERVED8;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010024) Timer T3 Count Register                                */
    
    struct {
      __IO uint16_t  T3         : 16;               /*!< [0..15] Timer T3 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T3;
  __I  uint16_t  RESERVED9;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010028) Timer T4 Count Register                                */
    
    struct {
      __IO uint16_t  T4         : 16;               /*!< [0..15] Timer T4 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T4;
  __I  uint16_t  RESERVED10;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4001002C) Timer 5 Count Register                                 */
    
    struct {
      __IO uint16_t  T5         : 16;               /*!< [0..15] Timer T5 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T5;
  __I  uint16_t  RESERVED11;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010030) Timer T6 Count Register                                */
    
    struct {
      __IO uint16_t  T6         : 16;               /*!< [0..15] Timer T6 Current Value                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T6;
} GPT12E_Type;


/* ================================================================================ */
/* ================                     TIMER2x                    ================ */
/* ================================================================================ */


/**
  * @brief TIMER2x (TIMER2x)
  */

typedef struct {                                    /*!< (@ 0x48004000) TIMER2 Structure                                       */
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004000) Timer 2 Control Register                               */
    
    struct {
      __IO uint8_t   CP_RL2     :  1;               /*!< [0..0] Capture/Reload Select                                          */
      __IO uint8_t   C_T2       :  1;               /*!< [1..1] Timer or Counter Select                                        */
      __IO uint8_t   TR2        :  1;               /*!< [2..2] Timer 2 Start/Stop Control                                     */
      __IO uint8_t   EXEN2      :  1;               /*!< [3..3] Timer 2 External Enable Control                                */
           uint8_t              :  2;
      __I  uint8_t   EXF2       :  1;               /*!< [6..6] Timer 2 External Flag                                          */
      __I  uint8_t   TF2        :  1;               /*!< [7..7] Timer 2 Overflow/Underflow Flag                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } T2CON;
  __I  uint8_t   RESERVED0[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004004) Timer 2 Mode Register                                  */
    
    struct {
      __IO uint8_t   DCEN       :  1;               /*!< [0..0] Up/Down Counter Enable                                         */
      __IO uint8_t   T2PRE      :  3;               /*!< [1..3] Timer 2 Prescaler Bit                                          */
      __IO uint8_t   PREN       :  1;               /*!< [4..4] Prescaler Enable                                               */
      __IO uint8_t   EDGESEL    :  1;               /*!< [5..5] Edge Select in Capture Mode/Reload Mode                        */
      __IO uint8_t   T2RHEN     :  1;               /*!< [6..6] Timer 2 External Start Enable                                  */
      __IO uint8_t   T2REGS     :  1;               /*!< [7..7] Edge Select for Timer 2 External Start                         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } T2MOD;
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004008) Timer 2 Reload/Capture Register, Low Byte              */
    
