alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel x Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC62R;
  __I  uint16_t  RESERVED15;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C040) Capture/Compare T12 Mode Select Register               */
    
    struct {
      __IO uint16_t  MSEL60     :  4;               /*!< [0..3] Capture/Compare Mode Selection                                 */
      __IO uint16_t  MSEL61     :  4;               /*!< [4..7] Capture/Compare Mode Selection                                 */
      __IO uint16_t  MSEL62     :  4;               /*!< [8..11] Capture/Compare Mode Selection                                */
      __IO uint16_t  HSYNC      :  3;               /*!< [12..14] Hall Synchronization                                         */
      __IO uint16_t  DBYP       :  1;               /*!< [15..15] Delay Bypass                                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12MSEL;
  __I  uint16_t  RESERVED16;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C044) Capture/Compare Interrupt Enable Register              */
    
    struct {
      __IO uint16_t  ENCC60R    :  1;               /*!< [0..0] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 0                                                             */
      __IO uint16_t  ENCC60F    :  1;               /*!< [1..1] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 0                                                         */
      __IO uint16_t  ENCC61R    :  1;               /*!< [2..2] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 1                                                             */
      __IO uint16_t  ENCC61F    :  1;               /*!< [3..3] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 1                                                         */
      __IO uint16_t  ENCC62R    :  1;               /*!< [4..4] Capture, Compare-Match Rising Edge Interrupt Enable for
                                                         Channel 2                                                             */
      __IO uint16_t  ENCC62F    :  1;               /*!< [5..5] Capture, Compare-Match Falling Edge Interrupt Enable
                                                         for Channel 2                                                         */
      __IO uint16_t  ENT12OM    :  1;               /*!< [6..6] Enable Interrupt for T12 One-Match                             */
      __IO uint16_t  ENT12PM    :  1;               /*!< [7..7] Enable Interrupt for T12 Period-Match                          */
      __IO uint16_t  ENT13CM    :  1;               /*!< [8..8] Enable Interrupt for T13 Compare-Match                         */
      __IO uint16_t  ENT13PM    :  1;               /*!< [9..9] Enable Interrupt for T13 Period-Match                          */
      __IO uint16_t  ENTRPF     :  1;               /*!< [10..10] Enable Interrupt for Trap Flag                               */
           uint16_t             :  1;
      __IO uint16_t  ENCHE      :  1;               /*!< [12..12] Enable Interrupt for Correct Hall Event                      */
      __IO uint16_t  ENWHE      :  1;               /*!< [13..13] Enable Interrupt for Wrong Hall Event                        */
      __IO uint16_t  ENIDLE     :  1;               /*!< [14..14] Enable Idle                                                  */
      __IO uint16_t  ENSTR      :  1;               /*!< [15..15] Enable Multi-Channel Mode Shadow Transfer Interrupt          */
    } bit;                                          /*!< [16] BitSize                                                          */
  } IEN;
  __I  uint16_t  RESERVED17;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C048) Capture/Compare Interrupt Node Pointer Register        */
    
    struct {
      __IO uint16_t  INPCC60    :  2;               /*!< [0..1] Interrupt Node Pointer for Channel 0 Interrupts                */
      __IO uint16_t  INPCC61    :  2;               /*!< [2..3] Interrupt Node Pointer for Channel 1 Interrupts                */
      __IO uint16_t  INPCC62    :  2;               /*!< [4..5] Interrupt Node Pointer for Channel 2 Interrupts                */
      __IO uint16_t  INPCHE     :  2;               /*!< [6..7] Interrupt Node Pointer for the CHE Interrupt                   */
      __IO uint16_t  INPERR     :  2;               /*!< [8..9] Interrupt Node Pointer for Error Interrupts                    */
      __IO uint16_t  INPT12     :  2;               /*!< [10..11] Interrupt Node Pointer for Timer T12 Interrupts              */
      __IO uint16_t  INPT13     :  2;               /*!< [12..13] Interrupt Node Pointer for Timer T13 Interrupts              */
    } bit;                                          /*!< [14] BitSize                                                          */
  } INP;
  __I  uint16_t  RESERVED18;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C04C) Capture/Compare Interrupt Status Set Register          */
    
    struct {
      __O  uint16_t  SCC60R     :  1;               /*!< [0..0] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC60F     :  1;               /*!< [1..1] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  SCC61R     :  1;               /*!< [2..2] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC61F     :  1;               /*!< [3..3] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  SCC62R     :  1;               /*!< [4..4] Set Capture, Compare-Match Rising Edge Flag                    */
      __O  uint16_t  SCC62F     :  1;               /*!< [5..5] Set Capture, Compare-Match Falling Edge Flag                   */
      __O  uint16_t  ST12OM     :  1;               /*!< [6..6] Set Timer T12 One-Match Flag                                   */
      __O  uint16_t  ST12PM     :  1;               /*!< [7..7] Set Timer T12 Period-Match Flag                                */
      __O  uint16_t  ST13CM     :  1;               /*!< [8..8] Set Timer T13 Compare-Match Flag                               */
      __O  uint16_t  ST13PM     :  1;               /*!< [9..9] Set Timer T13 Period-Match Flag                                */
      __O  uint16_t  STRPF      :  1;               /*!< [10..10] Set Trap Flag                                                */
      __O  uint16_t  SWHC       :  1;               /*!< [11..11] Software Hall Compare                                        */
      __O  uint16_t  SCHE       :  1;               /*!< [12..12] Set Correct Hall Event Flag                                  */
      __O  uint16_t  SWHE       :  1;               /*!< [13..13] Set Wrong Hall Event Flag                                    */
      __O  uint16_t  SIDLE      :  1;               /*!< [14..14] Set IDLE Flag                                                */
      __O  uint16_t  SSTR       :  1;               /*!< [15..15] Set STR Flag                                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } ISS;
  __I  uint16_t  RESERVED19;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C050) Passive State Level Register                           */
    
