alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint16_t  ISCC60     :  2;               /*!< [0..1] Input Select for CC60                                          */
      __IO uint16_t  ISCC61     :  2;               /*!< [2..3] Input Select for CC61                                          */
      __IO uint16_t  ISCC62     :  2;               /*!< [4..5] Input Select for CC62                                          */
      __IO uint16_t  ISTRP      :  2;               /*!< [6..7] Input Select for CTRAP                                         */
      __IO uint16_t  ISPOS0     :  2;               /*!< [8..9] Input Select for CCPOS0                                        */
      __IO uint16_t  ISPOS1     :  2;               /*!< [10..11] Input Select for CCPOS1                                      */
      __IO uint16_t  ISPOS2     :  2;               /*!< [12..13] Input Select for CCPOS2                                      */
      __IO uint16_t  IST12HR    :  2;               /*!< [14..15] Input Select for T12HR                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } PISEL0;
  __I  uint16_t  RESERVED27[3];
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C074) Port Input Select Register 2                           */
    
    struct {
      __IO uint16_t  IST13HR    :  2;               /*!< [0..1] Input Select for T13HR                                         */
      __IO uint16_t  ISCNT12    :  2;               /*!< [2..3] Input Select for T12 Counting Input                            */
      __IO uint16_t  ISCNT13    :  2;               /*!< [4..5] Input Select for T13 Counting Input                            */
      __IO uint16_t  T12EXT     :  1;               /*!< [6..6] Extension for T12HR Inputs                                     */
      __IO uint16_t  T13EXT     :  1;               /*!< [7..7] Extension for T13HR Inputs                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PISEL2;
  __I  uint16_t  RESERVED28;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C078) Timer T12 Counter Register                             */
    
    struct {
      __IO uint16_t  T12CV      : 16;               /*!< [0..15] Timer T12 Counter Value                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12;
  __I  uint16_t  RESERVED29;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C07C) Timer T13 Counter Register                             */
    
    struct {
      __IO uint16_t  T13CV      : 16;               /*!< [0..15] Timer T13 Counter Value                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T13;
  __I  uint16_t  RESERVED30;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C080) Compare State Register                                 */
    
    struct {
      __I  uint16_t  CC60ST     :  1;               /*!< [0..0] Capture/Compare State Bits (x = 0, 1, 2, 3)                    */
      __I  uint16_t  CC61ST     :  1;               /*!< [1..1] Capture/Compare State Bits (x = 0, 1, 2, 3)                    */
      __I  uint16_t  CC62ST     :  1;               /*!< [2..2] Capture/Compare State Bits (x = 0, 1, 2, 3)                    */
      __I  uint16_t  CCPOS0     :  1;               /*!< [3..3] Sampled Hall Pattern Bits (x = 0, 1, 2)                        */
      __I  uint16_t  CCPOS1     :  1;               /*!< [4..4] Sampled Hall Pattern Bits (x = 0, 1, 2)                        */
      __I  uint16_t  CCPOS2     :  1;               /*!< [5..5] Sampled Hall Pattern Bits (x = 0, 1, 2)                        */
      __I  uint16_t  CC63ST     :  1;               /*!< [6..6] Capture/Compare State Bits (x = 0, 1, 2, 3)                    */
           uint16_t             :  1;
      __IO uint16_t  CC60PS     :  1;               /*!< [8..8] Passive State Select for Compare Outputs                       */
      __IO uint16_t  COUT60PS   :  1;               /*!< [9..9] Passive State Select for Compare Outputs                       */
      __IO uint16_t  CC61PS     :  1;               /*!< [10..10] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT61PS   :  1;               /*!< [11..11] Passive State Select for Compare Outputs                     */
      __IO uint16_t  CC62PS     :  1;               /*!< [12..12] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT62PS   :  1;               /*!< [13..13] Passive State Select for Compare Outputs                     */
      __IO uint16_t  COUT63PS   :  1;               /*!< [14..14] Passive State Select for Compare Outputs                     */
      __IO uint16_t  T13IM      :  1;               /*!< [15..15] T13 Inverted Modulation                                      */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CMPSTAT;
} CCU6_Type;


/* ================================================================================ */
/* ================                      UARTx                     ================ */
/* ================================================================================ */


/**
  * @brief UARTx (UARTx)
  */

typedef struct {                                    /*!< (@ 0x48022000) UART2 Structure                                        */
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48022000) Serial Channel Control Register                        */
    
