alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
	  struct {
	    __IO uint16_t  BM       :  4;               /*!< [0..3] Data Width Selection                                           */
	    __IO uint16_t  HB       :  1;               /*!< [4..4] Heading Control                                                */
	    __IO uint16_t  PH       :  1;               /*!< [5..5] Clock Phase Control                                            */
	    __IO uint16_t  PO       :  1;               /*!< [6..6] Clock Polarity Control                                         */
	    __IO uint16_t  LB       :  1;               /*!< [7..7] Loop Back Control                                              */
	    __IO uint16_t  TEN      :  1;               /*!< [8..8] Transmit Error Enable                                          */
	    __IO uint16_t  REN      :  1;               /*!< [9..9] Receive Error Enable                                           */
	    __IO uint16_t  PEN      :  1;               /*!< [10..10] Phase Error Enable                                           */
	    __IO uint16_t  BEN      :  1;               /*!< [11..11] Baud Rate Error Enable                                       */
	    __IO uint16_t  AREN     :  1;               /*!< [12..12] Automatic Reset Enable                                       */
	         uint16_t           :  1;
	    __IO uint16_t  MS       :  1;               /*!< [14..14] Master Select                                                */
	    __IO uint16_t  EN       :  1;               /*!< [15..15] Enable Bit = 0                                               */
	  } PRG_bit;                                    /*!< [16] BitSize                                                          */
	} CON;
  __I  uint16_t  RESERVED1;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x48026008) Transmitter Buffer Register                            */
    
    struct {
      __IO uint16_t  TB_VALUE   : 16;               /*!< [0..15] Transmit Data Register Value                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TB;
  __I  uint16_t  RESERVED2;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4802600C) Receiver Buffer Register                               */
    
    struct {
      __I  uint16_t  RB_VALUE   : 16;               /*!< [0..15] Receive Data Register Value                                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } RB;
  __I  uint16_t  RESERVED3;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x48026010) Baud Rate Timer Reload Register                        */
    
    struct {
      __IO uint16_t  BR_VALUE   : 16;               /*!< [0..15] Baud Rate Timer/Reload Register Value                         */
    } bit;                                          /*!< [16] BitSize                                                          */
  } BR;
  __I  uint16_t  RESERVED4;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x48026014) Interrupt Status Register Clear                        */
    
    struct {
           uint16_t             :  8;
      __O  uint16_t  TECLR      :  1;               /*!< [8..8] Transmit Error Flag Clear                                      */
      __O  uint16_t  RECLR      :  1;               /*!< [9..9] Receive Error Flag Clear                                       */
      __O  uint16_t  PECLR      :  1;               /*!< [10..10] Phase Error Flag Clear                                       */
      __O  uint16_t  BECLR      :  1;               /*!< [11..11] Baud Rate Error Flag Clear                                   */
    } bit;                                          /*!< [12] BitSize                                                          */
  } ISRCLR;
} SSC_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief PMU (PMU)
  */

typedef struct {                                    /*!< (@ 0x50004000) PMU Structure                                          */
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50004000) Main wake status register                              */
    
    struct {
      __I  uint8_t   LIN_WAKE   :  1;               /*!< [0..0] Wake-up via LIN- Message                                       */
      __I  uint8_t   MON_WAKE   :  1;               /*!< [1..1] Wake-up via MON                                                */
      __I  uint8_t   GPIO0      :  1;               /*!< [2..2] Wake-up via GPIO0 which is a logical OR combination of
                                                         all Wake_STS_GPIO0 bits                                               */
      __I  uint8_t   GPIO1      :  1;               /*!< [3..3] Wake-up via GPIO1 which is a logical OR combination of
                                                         all Wake_STS_GPIO1 bits                                               */
      __I  uint8_t   CYC_WAKE   :  1;               /*!< [4..4] Wake-up caused by Cyclic Wake                                  */
      __I  uint8_t   FAIL       :  1;               /*!< [5..5] Wake-up after VDDEXT Fail                                      */
    } bit;                                          /*!< [6] BitSize                                                           */
  } WAKE_STATUS;
  __I  uint8_t   RESERVED0[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004004) Voltage Reg Status Register                            */
    
    struct {
      __I  uint8_t   PMU_1V5_OVERVOLT:  1;          /*!< [0..0] Overvoltage at VDDC regulator                                  */
      __I  uint8_t   PMU_1V5_OVERLOAD:  1;          /*!< [1..1] Overload at VDDC regulator                                     */
      __IO uint8_t   PMU_1V5_FAIL_EN:  1;           /*!< [2..2] Enabling of VDDC status information as interrupt source        */
           uint8_t              :  1;
      __I  uint8_t   PMU_5V_OVERVOLT:  1;           /*!< [4..4] Overvoltage at VDDP regulator                                  */
      __I  uint8_t   PMU_5V_OVERLOAD:  1;           /*!< [5..5] Overload at VDDP regulator                                     */
      __IO uint8_t   PMU_5V_FAIL_EN:  1;            /*!< [6..6] Enabling of VDDP status information as interrupt source        */
    } bit;                                          /*!< [7] BitSize                                                           */
  } PMU_SUPPLY_STS;
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004008) VDDEXT Control                                         */
    
