alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
           uint32_t             :  1;
      __IO uint32_t  VS_UV_IE   :  1;               /*!< [1..1] VS Undervoltage Interrupt Enable                               */
      __IO uint32_t  VDD5V_UV_IE:  1;               /*!< [2..2] VDD5V Undervoltage Interrupt Enable                            */
      __IO uint32_t  VDD1V5_UV_IE:  1;              /*!< [3..3] VDD1V5 Undervoltage Interrupt Enable                           */
           uint32_t             :  1;
      __IO uint32_t  VS_OV_IE   :  1;               /*!< [5..5] VS Overvoltage Interrupt Enable                                */
      __IO uint32_t  VDD5V_OV_IE:  1;               /*!< [6..6] VDD5V Overvoltage Interrupt Enable                             */
      __IO uint32_t  VDD1V5_OV_IE:  1;              /*!< [7..7] VDD1V5 Overvoltage Interrupt Enable                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SYS_SUPPLY_IRQ_CTRL;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006024) System Supply Interrupt Status Clear                   */
    
    struct {
           uint32_t             :  1;
      __O  uint32_t  VS_UV_ICLR :  1;               /*!< [1..1] VS Undervoltage Interrupt Status (ADC2 channel 1)              */
      __O  uint32_t  VDD5V_UV_ICLR:  1;             /*!< [2..2] VDDP Undervoltage Interrupt Status (ADC2 channel 2)            */
      __O  uint32_t  VDD1V5_UV_ICLR:  1;            /*!< [3..3] VDDC Undervoltage Interrupt Status (ADC2 channel 3)            */
           uint32_t             :  1;
      __O  uint32_t  VS_OV_ICLR :  1;               /*!< [5..5] VS Overvoltage Interrupt Status (ADC2 channel 1)               */
      __O  uint32_t  VDD5V_OV_ICLR:  1;             /*!< [6..6] VDDP Overvoltage Interrupt Status (ADC2 channel 2)             */
      __O  uint32_t  VDD1V5_OV_ICLR:  1;            /*!< [7..7] VDDC Overvoltage Interrupt Status (ADC2 channel 3)             */
           uint32_t             :  9;
      __O  uint32_t  VS_UV_SCLR :  1;               /*!< [17..17] VS Undervoltage Status                                       */
      __O  uint32_t  VDD5V_UV_SCLR:  1;             /*!< [18..18] VDDP Undervoltage Status                                     */
      __O  uint32_t  VDD1V5_UV_SCLR:  1;            /*!< [19..19] VDDC Undervoltage Status                                     */
           uint32_t             :  1;
      __O  uint32_t  VS_OV_SCLR :  1;               /*!< [21..21] VS Overvoltage Interrupt Status                              */
      __O  uint32_t  VDD5V_OV_SCLR:  1;             /*!< [22..22] VDDP Overvoltage Status                                      */
      __O  uint32_t  VDD1V5_OV_SCLR:  1;            /*!< [23..23] VDDC Overvoltage Status                                      */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYS_SUPPLY_IRQ_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006028) System Interrupt Control                               */
    
    struct {
      __IO uint32_t  LIN_OC_IE  :  1;               /*!< [0..0] LIN Overcurrent Interrupt Enable                               */
      __IO uint32_t  LIN_OT_IE  :  1;               /*!< [1..1] LIN Overtemperature Interrupt Enable                           */
      __IO uint32_t  LIN_TMOUT_IE:  1;              /*!< [2..2] LIN TXD timeout Interrupt Enable                               */
           uint32_t             :  3;
      __IO uint32_t  PMU_OTWARN_IE:  1;             /*!< [6..6] PMU Regulator Overtemperature Warning Interrupt Enable         */
      __IO uint32_t  PMU_OT_IE  :  1;               /*!< [7..7] PMU Regulator Overtemperature Shutdown Interrupt Enable
                                                         (leads to shutdown of System)                                         */
      __IO uint32_t  SYS_OTWARN_IE:  1;             /*!< [8..8] System Overtemperature Warning Interrupt Enable                */
      __IO uint32_t  SYS_OT_IE  :  1;               /*!< [9..9] System Overtemperature Shutdown Interrupt Enable (leads
                                                         to shutdown of System)                                                */
      __IO uint32_t  REFBG_LOTHWARN_IE:  1;         /*!< [10..10] Reference Voltage Undervoltage Interrupt Enable              */
      __IO uint32_t  REFBG_UPTHWARN_IE:  1;         /*!< [11..11] Reference Voltage Overvoltage Interrupt Enable               */
      __IO uint32_t  VREF5V_LOWTH_IE:  1;           /*!< [12..12] VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4)
                                                         Interrupt Enable                                                      */
      __IO uint32_t  VREF5V_UPTH_IE:  1;            /*!< [13..13] VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4)
                                                         Interrupt Enable                                                      */
      __IO uint32_t  VREF5V_OVL_IE:  1;             /*!< [14..14] VREF5V Overload Interrupt Enable                             */
      __IO uint32_t  ADC2_ESM_IE:  1;               /*!< [15..15] ADC2 Exceptional Sequence Measurement Interrupt Enable       */
      __IO uint32_t  PHU_ZCLOW_IE:  1;              /*!< [16..16] Phase U Zero Crossing Comperator Low Interrupt Enable        */
      __IO uint32_t  PHU_ZCHI_IE:  1;               /*!< [17..17] Phase U Zero Crossing Comperator High Interrupt Enable       */
      __IO uint32_t  PHV_ZCLOW_IE:  1;              /*!< [18..18] Phase V Zero Crossing Comperator Low Interrupt Enable        */
      __IO uint32_t  PHV_ZCHI_IE:  1;               /*!< [19..19] Phase V Zero Crossing Comperator High Interrupt Enable       */
      __IO uint32_t  PHW_ZCLOW_IE:  1;              /*!< [20..20] Phase W Zero Crossing Comperator Low Interrupt Enable        */
      __IO uint32_t  PHW_ZCHI_IE:  1;               /*!< [21..21] Phase W Zero Crossing Comperator High Interrupt Enable       */
    } bit;                                          /*!< [22] BitSize                                                          */
  } SYS_IRQ_CTRL;
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006030) Power Control Unit Control Status                      */
    
