alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  LS1_DS_IS  :  1;               /*!< [0..0] Bridge Driver Low Side 1 Pre-Driver short Interrupt Status     */
      __I  uint32_t  LS2_DS_IS  :  1;               /*!< [1..1] Bridge Driver Low Side 2 Pre-Driver short Interrupt Status     */
      __I  uint32_t  HS1_DS_IS  :  1;               /*!< [2..2] Bridge Driver High Side 1 Pre-Driver short Interrupt
                                                         Status                                                                */
      __I  uint32_t  HS2_DS_IS  :  1;               /*!< [3..3] Bridge Driver High Side 2 Pre-Driver short Interrupt
                                                         Status                                                                */
      __I  uint32_t  LS3_DS_IS  :  1;               /*!< [4..4] Bridge Driver Low Side 3 Pre-Driver short Interrupt Status     */
      __I  uint32_t  HS3_DS_IS  :  1;               /*!< [5..5] Bridge Driver High Side 3 Pre-Driver short Interrupt
                                                         Status                                                                */
           uint32_t             :  4;
      __I  uint32_t  LS1_OC_IS  :  1;               /*!< [10..10] External Low Side 1 FET Over-current Status                  */
      __I  uint32_t  LS2_OC_IS  :  1;               /*!< [11..11] External Low Side 2 FET Over-current Status                  */
      __I  uint32_t  HS1_OC_IS  :  1;               /*!< [12..12] External High 1 FET Over-current Status                      */
      __I  uint32_t  HS2_OC_IS  :  1;               /*!< [13..13] External High Side 2 FET Over-current Status                 */
      __I  uint32_t  LS3_OC_IS  :  1;               /*!< [14..14] External Low Side 3 FET Over-current Status                  */
      __I  uint32_t  HS3_OC_IS  :  1;               /*!< [15..15] External High Side 3 FET Over-current Status                 */
      __I  uint32_t  VCP_LOWTH2_IS:  1;             /*!< [16..16] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Interrupt Status                                      */
      __I  uint32_t  VCP_LOWTH1_IS:  1;             /*!< [17..17] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Interrupt Status                                           */
      __I  uint32_t  VCP_UPTH_IS:  1;               /*!< [18..18] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Interrupt Status                                                   */
      __I  uint32_t  VSD_LOWTH_IS:  1;              /*!< [19..19] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
      __I  uint32_t  VSD_UPTH_IS:  1;               /*!< [20..20] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
           uint32_t             :  3;
      __I  uint32_t  VCP_LOWTH2_STS:  1;            /*!< [24..24] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Status                                                */
      __I  uint32_t  VCP_LOWTH1_STS:  1;            /*!< [25..25] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Status                                                     */
      __I  uint32_t  VCP_UPTH_STS:  1;              /*!< [26..26] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Status                                                             */
      __I  uint32_t  VSD_LOWTH_STS:  1;             /*!< [27..27] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
      __I  uint32_t  VSD_UPTH_STS:  1;              /*!< [28..28] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
    } bit;                                          /*!< [29] BitSize                                                          */
  } BDRV_IS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000605C) Bridge Driver Interrupt Control                        */
    
    struct {
      __IO uint32_t  LS1_DS_IE  :  1;               /*!< [0..0] Bridge Driver Low Side 1 Pre-Driver Short Interrupt Enable     */
      __IO uint32_t  LS2_DS_IE  :  1;               /*!< [1..1] Bridge Driver Low Side 2 Pre-Driver Short Interrupt Enable     */
      __IO uint32_t  HS1_DS_IE  :  1;               /*!< [2..2] Bridge Driver High Side 1 Pre-Driver Short Interrupt
                                                         Enable                                                                */
      __IO uint32_t  HS2_DS_IE  :  1;               /*!< [3..3] Bridge Driver High Side 2 Pre-Driver Short Interrupt
                                                         Enable                                                                */
      __IO uint32_t  LS3_DS_IE  :  1;               /*!< [4..4] Bridge Driver Low Side 3 Pre-Driver Short Interrupt Enable     */
      __IO uint32_t  HS3_DS_IE  :  1;               /*!< [5..5] Bridge Driver High Side 3 Pre-Driver Short Interrupt
                                                         Enable                                                                */
           uint32_t             :  4;
      __IO uint32_t  LS1_OC_IE  :  1;               /*!< [10..10] External Low Side 1 FET Over-current Interrupt Enable        */
      __IO uint32_t  LS2_OC_IE  :  1;               /*!< [11..11] External Low Side 2 FET Over-current Interrupt Enable        */
      __IO uint32_t  HS1_OC_IE  :  1;               /*!< [12..12] External High Side 1 FET Over-current Interrupt Enable       */
      __IO uint32_t  HS2_OC_IE  :  1;               /*!< [13..13] External High Side 2 FET Over-current Interrupt Enable       */
      __IO uint32_t  LS3_OC_IE  :  1;               /*!< [14..14] External Low Side 3 FET Over-current Interrupt Enable        */
      __IO uint32_t  HS3_OC_IE  :  1;               /*!< [15..15] External High Side 3 FET Over-current Interrupt Enable       */
      __IO uint32_t  VCP_LOWTH2_IE:  1;             /*!< [16..16] VCP Measurement Lower Threshold 2 Interrupt Enable           */
      __IO uint32_t  VCP_LOWTH1_IE:  1;             /*!< [17..17] VCP Measurement Lower Threshold 1 Interrupt Enable           */
      __IO uint32_t  VCP_UPTH_IE:  1;               /*!< [18..18] VCP Measurement Upper Threshold Interrupt Enable             */
      __IO uint32_t  VSD_LOWTH_IE:  1;              /*!< [19..19] VSD Measurement Lower Threshold Interrupt Enable             */
      __IO uint32_t  VSD_UPTH_IE:  1;               /*!< [20..20] VSD Measurement Upper Threshold Interrupt Enable             */
    } bit;                                          /*!< [21] BitSize                                                          */
  } BDRV_IRQ_CTRL;
  __I  uint32_t  RESERVED4[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000606C) System Tick Calibration Register                       */
    
