alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Active for GPT1                                      */
      __I  uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Active for GPT2                                      */
      __I  uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Active for MU, ADC2                                  */
      __I  uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Active for ADC1                                      */
      __I  uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Active for CCU6 SR0                                  */
      __I  uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Active for CCU6 SR1                                  */
      __I  uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Active for CCU6 SR2                                  */
      __I  uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Active for CCU6 SR3                                  */
      __I  uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Active for SSC1                                      */
      __I  uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Active for SSC2                                      */
      __I  uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Active for UART1                                   */
      __I  uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Active for UART2                                   */
      __I  uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Active for External Int 0                          */
      __I  uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Active for External Int 1                          */
      __I  uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Active for Bridge Driver                           */
      __I  uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Active for DMA                                     */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_IABR0;
  __I  uint32_t  RESERVED8[63];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E400) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_GPT1   :  8;               /*!< [0..7] Priority for GPT1                                              */
      __IO uint32_t  PRI_GPT2   :  8;               /*!< [8..15] Priority for GPT2                                             */
      __IO uint32_t  PRI_ADC2   :  8;               /*!< [16..23] Priority for MU, ADC2                                        */
      __IO uint32_t  PRI_ADC1   :  8;               /*!< [24..31] Priority for ADC1                                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E404) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_CCU6SR0:  8;               /*!< [0..7] Priority for CCU6 SR0                                          */
      __IO uint32_t  PRI_CCU6SR1:  8;               /*!< [8..15] Priority for CCU6 SR1                                         */
      __IO uint32_t  PRI_CCU6SR2:  8;               /*!< [16..23] Priority for CCU6 SR2                                        */
      __IO uint32_t  PRI_CCU6SR3:  8;               /*!< [24..31] Priority for CCU6 SR3                                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E408) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_SSC1   :  8;               /*!< [0..7] Priority for SSC1                                              */
      __IO uint32_t  PRI_SSC2   :  8;               /*!< [8..15] Priority for SSC2                                             */
      __IO uint32_t  PRI_UART1  :  8;               /*!< [16..23] Priority for UART1                                           */
      __IO uint32_t  PRI_UART2  :  8;               /*!< [24..31] Priority for UART2                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E40C) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_EXINT0 :  8;               /*!< [0..7] Priority for Ext. Int 0                                        */
      __IO uint32_t  PRI_EXINT1 :  8;               /*!< [8..15] Priority for Ext. Int 1                                       */
      __IO uint32_t  PRI_BDRV   :  8;               /*!< [16..23] Priority for Bridge Driver                                   */
      __IO uint32_t  PRI_DMA    :  8;               /*!< [24..31] Priority for DMA                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR3;
  __I  uint32_t  RESERVED9[572];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000ED00) CPU ID Base Register                                   */
    
    struct {
      __I  uint32_t  REVISION   :  4;               /*!< [0..3] Revision Number                                                */
      __I  uint32_t  PARTNO     : 12;               /*!< [4..15] Part Number                                                   */
      __I  uint32_t  ARCHITECTURE:  4;              /*!< [16..19] Architecture                                                 */
      __I  uint32_t  VARIANT    :  4;               /*!< [20..23] Variant Number                                               */
      __I  uint32_t  IMPLEMENTER:  8;               /*!< [24..31] Implementer Code                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CPUID;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED04) Interrupt Control State Register                       */
    
