alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  VECTACTIVE :  9;               /*!< [0..8] VECTACTIVE                                                     */
           uint32_t             :  2;
      __I  uint32_t  RETTOBASE  :  1;               /*!< [11..11] RETTOBASE                                                    */
      __I  uint32_t  VECTPENDING:  9;               /*!< [12..20] VECTPENDING                                                  */
           uint32_t             :  1;
      __I  uint32_t  ISRPENDING :  1;               /*!< [22..22] ISRPENDING                                                   */
      __I  uint32_t  ISRPREEMPT :  1;               /*!< [23..23] ISRPREEMPT                                                   */
           uint32_t             :  1;
      __O  uint32_t  PENDSTCLR  :  1;               /*!< [25..25] PENDSTCLR                                                    */
      __IO uint32_t  PENDSTSET  :  1;               /*!< [26..26] PENDSTSET                                                    */
      __O  uint32_t  PENDSVCLR  :  1;               /*!< [27..27] PENDSVCLR                                                    */
      __IO uint32_t  PENDSVSET  :  1;               /*!< [28..28] PENDSVSET                                                    */
           uint32_t             :  2;
      __IO uint32_t  NMIPENDSET :  1;               /*!< [31..31] NMI PendSet                                                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ICSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED08) Vector Table Offset Register                           */
    
    struct {
           uint32_t             :  7;
      __IO uint32_t  TBLOFF     : 25;               /*!< [7..31] Vector Table Offset                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } VTOR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED0C) Application Interrupt/Reset Control Register           */
    
    struct {
      __O  uint32_t  VECTRESET  :  1;               /*!< [0..0] VECTRESET                                                      */
      __O  uint32_t  VECTCLRACTIVE:  1;             /*!< [1..1] VECTCLRACTIVE                                                  */
      __IO uint32_t  SYSRESETREQ:  1;               /*!< [2..2] System Reset Request                                           */
           uint32_t             :  5;
      __IO uint32_t  PRIGROUP   :  3;               /*!< [8..10] Priority Grouping                                             */
           uint32_t             :  4;
      __I  uint32_t  ENDIANNESS :  1;               /*!< [15..15] Memory System Endianness                                     */
      __IO uint32_t  VECTKEY    : 16;               /*!< [16..31] Vector Key                                                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } AIRCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED10) System Control Register                                */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  SLEEPONEXIT:  1;               /*!< [1..1] Sleep on Exit                                                  */
      __IO uint32_t  SLEEPDEEP  :  1;               /*!< [2..2] Sleep Deep                                                     */
           uint32_t             :  1;
      __IO uint32_t  SEVONPEND  :  1;               /*!< [4..4] SEVONPEND                                                      */
    } bit;                                          /*!< [5] BitSize                                                           */
  } SCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED14) Configuration Control Register                         */
    
    struct {
      __IO uint32_t  NONBASETHRDENA:  1;            /*!< [0..0] NONBASETHRDENA                                                 */
      __IO uint32_t  USERSETMPEND:  1;              /*!< [1..1] USERSETMPEND                                                   */
           uint32_t             :  1;
      __IO uint32_t  UNALIGN_TRP:  1;               /*!< [3..3] UNALIGN_TRP                                                    */
      __IO uint32_t  DIV_0_TRP  :  1;               /*!< [4..4] DIV_0_TRP                                                      */
           uint32_t             :  3;
      __IO uint32_t  BFHFMIGN   :  1;               /*!< [8..8] BFHFMIGN                                                       */
      __IO uint32_t  STKALIGN   :  1;               /*!< [9..9] STKALIGN                                                       */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED18) System Handler Priority Register 1                     */
    
    struct {
      __IO uint32_t  PRI_4      :  8;               /*!< [0..7] Priority of System Handler 4, MemManage                        */
      __IO uint32_t  PRI_5      :  8;               /*!< [8..15] Priority of System Handler 5, BusFault                        */
      __IO uint32_t  PRI_6      :  8;               /*!< [16..23] Priority of System Handler 6, UsageFault                     */
      __IO uint32_t  PRI_7      :  8;               /*!< [24..31] Reserved for Priority of System Handler 7                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR1;
  __I  uint32_t  RESERVED10;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED20) System Handler Priority Register 3                     */
    
