alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  PRI_12     :  8;               /*!< [0..7] Priority of System Handler 12, DebugMonitor                    */
      __IO uint32_t  PRI_13     :  8;               /*!< [8..15] Reserved for Priority of System Handler 13                    */
      __IO uint32_t  PRI_14     :  8;               /*!< [16..23] Priority of System Handler 14, PendSV                        */
      __IO uint32_t  PRI_15     :  8;               /*!< [24..31] Priority of System Handler 15, SysTick                       */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED24) System Handler Control and State Register              */
    
    struct {
      __IO uint32_t  MEMFAULTACT:  1;               /*!< [0..0] MEMFAULTACT                                                    */
      __IO uint32_t  BUSFAULTACT:  1;               /*!< [1..1] BUSFAULTACT                                                    */
           uint32_t             :  1;
      __IO uint32_t  USGFAULTACT:  1;               /*!< [3..3] USGFAULTACT                                                    */
           uint32_t             :  3;
      __IO uint32_t  SVCALLACT  :  1;               /*!< [7..7] SVCALLACT                                                      */
      __IO uint32_t  MONITORACT :  1;               /*!< [8..8] MONITORACT                                                     */
           uint32_t             :  1;
      __IO uint32_t  PENDSVACT  :  1;               /*!< [10..10] PENDSVACT                                                    */
      __IO uint32_t  SYSTICKACT :  1;               /*!< [11..11] SYSTICKACT                                                   */
      __IO uint32_t  USGFAULTPENDED:  1;            /*!< [12..12] USGFAULTPENDED                                               */
      __IO uint32_t  MEMFAULTPENDED:  1;            /*!< [13..13] MEMFAULTPENDED                                               */
      __IO uint32_t  BUSFAULTPENDED:  1;            /*!< [14..14] BUSFAULTPENDED                                               */
      __IO uint32_t  SVCALLPENDED:  1;              /*!< [15..15] SVCALLPENDED                                                 */
      __IO uint32_t  MEMFAULTENA:  1;               /*!< [16..16] MEMFAULTENA                                                  */
      __IO uint32_t  BUSFAULTENA:  1;               /*!< [17..17] BUSFAULTENA                                                  */
      __IO uint32_t  USGFAULTENA:  1;               /*!< [18..18] USGFAULTENA                                                  */
    } bit;                                          /*!< [19] BitSize                                                          */
  } SHCSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED28) Configurable Fault Status Register                     */
    
    struct {
      __IO uint32_t  IACCVIOL   :  1;               /*!< [0..0] IACCVIOL                                                       */
      __IO uint32_t  DACCVIOL   :  1;               /*!< [1..1] DACCVIOL                                                       */
           uint32_t             :  1;
      __IO uint32_t  MUNSTKERR  :  1;               /*!< [3..3] MUNSTKERR                                                      */
      __IO uint32_t  MSTERR     :  1;               /*!< [4..4] MSTERR                                                         */
      __IO uint32_t  MLSPERR    :  1;               /*!< [5..5] MLSPERR                                                        */
           uint32_t             :  1;
      __IO uint32_t  MMARVALID  :  1;               /*!< [7..7] MMARVALID                                                      */
      __IO uint32_t  IBUSERR    :  1;               /*!< [8..8] IBUSERR                                                        */
      __IO uint32_t  PRECISERR  :  1;               /*!< [9..9] PRECISERR                                                      */
      __IO uint32_t  IMPRECISERR:  1;               /*!< [10..10] IMPRECISERR                                                  */
      __IO uint32_t  UNSTKERR   :  1;               /*!< [11..11] UNSTKERR                                                     */
      __IO uint32_t  STKERR     :  1;               /*!< [12..12] STKERR                                                       */
      __IO uint32_t  LSPERR     :  1;               /*!< [13..13] LSPERR                                                       */
           uint32_t             :  1;
      __IO uint32_t  BFARVALID  :  1;               /*!< [15..15] BFAR Valid                                                   */
      __IO uint32_t  UNDEFINSTR :  1;               /*!< [16..16] Undefined Instruction                                        */
      __IO uint32_t  INVSTATE   :  1;               /*!< [17..17] INVSTATE                                                     */
      __IO uint32_t  INVPC      :  1;               /*!< [18..18] INVPC                                                        */
      __IO uint32_t  NOCP       :  1;               /*!< [19..19] No CP                                                        */
           uint32_t             :  4;
      __IO uint32_t  UNALIGNED  :  1;               /*!< [24..24] Unaligned                                                    */
      __IO uint32_t  DIVBYZERO  :  1;               /*!< [25..25] Divide by Zero                                               */
    } bit;                                          /*!< [26] BitSize                                                          */
  } CFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED2C) Hard Fault Status Register                             */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  VECTTBL    :  1;               /*!< [1..1] VECTTBL                                                        */
           uint32_t             : 28;
      __IO uint32_t  FORCED     :  1;               /*!< [30..30] Forced                                                       */
      __IO uint32_t  DEBUGEVT   :  1;               /*!< [31..31] Debug Event                                                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } HFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED30) Debug Fault Status Register                            */
    
