alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  HALTED     :  1;               /*!< [0..0] HALTED                                                         */
      __IO uint32_t  BKPT       :  1;               /*!< [1..1] BKPT                                                           */
      __IO uint32_t  DWTTRAP    :  1;               /*!< [2..2] DWTTRAP                                                        */
      __IO uint32_t  VCATCH     :  1;               /*!< [3..3] Vector Catch                                                   */
      __IO uint32_t  EXTERNAL   :  1;               /*!< [4..4] External                                                       */
    } bit;                                          /*!< [5] BitSize                                                           */
  } DFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED34) MemManage Fault Status Register                        */
    
    struct {
      __IO uint32_t  ADDRESS    : 32;               /*!< [0..31] Data Address for an MPU Fault                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } MMFAR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED38) Bus Fault Status Register                              */
    
    struct {
      __IO uint32_t  ADDRESS    : 32;               /*!< [0..31] Data Address for a precise BusFault                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } BFAR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED3C) Auxiliary Fault Status Register                        */
    
    struct {
      __IO uint32_t  CP0        :  2;               /*!< [0..1] Access Privileges for Coprocessor 0 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP1        :  2;               /*!< [2..3] Access Privileges for Coprocessor 1 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP2        :  2;               /*!< [4..5] Access Privileges for Coprocessor 2 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP3        :  2;               /*!< [6..7] Access Privileges for Coprocessor 3 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP4        :  2;               /*!< [8..9] Access Privileges for Coprocessor 4 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP5        :  2;               /*!< [10..11] Access Privileges for Coprocessor 5 (n= 0-7, 10, 11)         */
      __IO uint32_t  CP6        :  2;               /*!< [12..13] Access Privileges for Coprocessor 6 (n= 0-7, 10, 11)         */
      __IO uint32_t  CP7        :  2;               /*!< [14..15] Access Privileges for Coprocessor 7 (n= 0-7, 10, 11)         */
           uint32_t             :  4;
      __IO uint32_t  CP10       :  2;               /*!< [20..21] Access Privileges for Coprocessor 10 (n= 0-7, 10, 11)        */
      __IO uint32_t  CP11       :  2;               /*!< [22..23] Access Privileges for Coprocessor 11 (n= 0-7, 10, 11)        */
    } bit;                                          /*!< [24] BitSize                                                          */
  } AFSR;
} CPU_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA (DMA)
  */

typedef struct {                                    /*!< (@ 0x50014000) DMA Structure                                          */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50014000) DMA Status                                             */
    
    struct {
      __I  uint32_t  MASTER_ENABLE:  1;             /*!< [0..0] Enable Status of the Controller                                */
           uint32_t             :  3;
      __I  uint32_t  STATE      :  4;               /*!< [4..7] Current State of the Control State Machine                     */
           uint32_t             :  8;
      __I  uint32_t  CHNLS_MINUS1:  5;              /*!< [16..20] Available Channels minus 1                                   */
    } bit;                                          /*!< [21] BitSize                                                          */
  } STATUS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014004) DMA Configuration                                      */
    
    struct {
      __O  uint32_t  MASTER_ENABLE:  1;             /*!< [0..0] Enable for the Controller                                      */
           uint32_t             :  4;
      __O  uint32_t  CHN1_PROT_CTRL:  3;            /*!< [5..7] CHN1_PROT_CTRL                                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CFG;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014008) Channel Control Data Base Pointer                      */
    
    struct {
           uint32_t             :  9;
      __IO uint32_t  CTRL_BASE_PTR: 23;             /*!< [9..31] CTRL_BASE_PTR                                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL_BASE_PTR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5001400C) Channel Alternate Control Data Base Pointer            */
    
    struct {
      __I  uint32_t  ALT_CTRL_BASE_PTR: 32;         /*!< [0..31] Base Address of the Alternate Data Structure                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ALT_CTRL_BASE_PTR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50014010) Channel Wait on Request Status                         */
    
