alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  WAITONREQ_STATUS: 14;          /*!< [0..13] Channel Wait on Request Status                                */
    } bit;                                          /*!< [14] BitSize                                                          */
  } WAITONREQ_STATUS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014014) Channel Software Request                               */
    
    struct {
      __O  uint32_t  CHNL_SW_REQUEST: 14;           /*!< [0..13] CHNL_SW_REQUEST                                               */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_SW_REQUEST;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014018) Channel Useburst Set                                   */
    
    struct {
      __IO uint32_t  CHNL_USEBURST_SET: 14;         /*!< [0..13] CHNL_USEBURST_SET: 0b0=on read: DMA channel n responds
                                                         to requests that it receives on dma_req[C] or dma_sreq[C]. The
                                                          controller performs 2, or single, bus transfers., 0b1=on read:
                                                          DMA channel n does not respond to requests that it receives
                                                          on dma_req[C] or dma_sreq[C]. The controller only reponds to
                                                          dma_req[C] requests and performs 2 transfers., 0b0=on write:
                                                          No effect. Use the CHNL_USEBURST_CLR Register to set bit [C]
                                                          to 0., 0b1=on write: Disables dma_sreq[C] from generating DMA
                                                          requests. The controller                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_USEBURST_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001401C) Channel Useburst Clear                                 */
    
    struct {
      __O  uint32_t  CHNL_USEBURST_CLR: 14;         /*!< [0..13] CHNL_USEBURST_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_USEBURST_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014020) Channel Request Mask Set                               */
    
    struct {
      __IO uint32_t  CHNL_REQ_MASK_SET: 14;         /*!< [0..13] CHNL_REQ_MASK_SET: 0b0=on read: External requests are
                                                         enabled for channel C., 0b1=on read: External requests are disabled
                                                          for channel C., 0b0=on write: No effect. Use the CHNL_REQ_MASK_CLR
                                                          Register to enable DMA requests., 0b1=on write: Disables dma_req[C]
                                                          and dma_sreq[C] from generating DMA requests.,                       */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_REQ_MASK_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014024) Channel Request Mask Clear                             */
    
    struct {
      __O  uint32_t  CHNL_REQ_MASK_CLR: 14;         /*!< [0..13] CHNL_REQ_MASK_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_REQ_MASK_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014028) Channel Enable Set                                     */
    
    struct {
      __IO uint32_t  CHNL_ENABLE_SET: 14;           /*!< [0..13] CHNL_ENABLE_SET: 0b0=on read: Channel C is disabled.,
                                                         0b1=on read: Channel C is enabled., 0b0=on write: No effect.
                                                          Use the CHNL_ENABLE_CLR Register to disable a channel., 0b1=on
                                                          write: Enables channel C.,                                           */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_ENABLE_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001402C) Channel Enable Clear                                   */
    
    struct {
      __O  uint32_t  CHNL_ENABLE_CLR: 14;           /*!< [0..13] CHNL_ENABLE_CLR                                               */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_ENABLE_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014030) Channel Primary-Alternate Set                          */
    
    struct {
      __IO uint32_t  CHNL_PRI_ALT_SET: 14;          /*!< [0..13] CHNL_PRI_ALT_SET: 0b0=on read: DMA channel C is using
                                                         the primary data structure., 0b1=on read: DMA channel C is using
                                                          the alternate data structure., 0b0=on write: No effect. Use
                                                          the CHNL_PRI_ALT_CLR Register to set bit [C] to 0., 0b1=on write:
                                                          Selects the alternate data structure for channel C.,                 */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRI_ALT_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014034) Channel Primary-Alternate Clear                        */
    
