alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __O  uint32_t  CHNL_PRI_ALT_CLR: 14;          /*!< [0..13] CHNL_PRI_ALT_CLR                                              */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRI_ALT_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014038) Channel Priority Set                                   */
    
    struct {
      __IO uint32_t  CHNL_PRIORITY_SET: 14;         /*!< [0..13] CHNL_PRIORITY_SET: 0b0=on read: DMA channel C is using
                                                         the default priority level., 0b1=on read: DMA channel C is using
                                                          a high priority level., 0b0=on write: No effect. Use the CHNL_ENABLE_CLR
                                                          Register to set channel C to the default priority level., 0b1=on
                                                          write: Channel C uses the high priority level.,                      */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRIORITY_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001403C) Channel Priority Clear                                 */
    
    struct {
      __O  uint32_t  CHNL_PRIORITY_CLR: 14;         /*!< [0..13] CHNL_PRIORITY_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRIORITY_CLR;
  __I  uint32_t  RESERVED0[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5001404C) Bus Error Clear                                        */
    
    struct {
      __IO uint32_t  ERR_CLR    :  1;               /*!< [0..0] ERR_CLR: 0b0=on read: dma_err is LOW., 0b1=on read: dma_err
                                                         is HIGH., 0b0=on write: No effect, status of dma_err is unchanged.,
                                                          0b1=on write: Sets dma_err LOW.,                                     */
    } bit;                                          /*!< [1] BitSize                                                           */
  } ERR_CLR;
} DMA_Type;


/* ================================================================================ */
/* ================                     TIMER3                     ================ */
/* ================================================================================ */


/**
  * @brief TIMER3 (TIMER3)
  */

typedef struct {                                    /*!< (@ 0x48006000) TIMER3 Structure                                       */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006000) T3 Trigger Control                                     */
    
    struct {
      __IO uint32_t  T3_TRIGG_INP_SEL:  3;          /*!< [0..2] Timer 3 Trigger Input Event Selection (only in mode3b)         */
           uint32_t             :  1;
      __IO uint32_t  T3_RES_CONF:  2;               /*!< [4..5] Timer 3 Trigger Reset Selection for Mode 1b                    */
      __IO uint32_t  RETRIG     :  1;               /*!< [6..6] Retrigger Condition (in mode 1b) for CCU6-T12 ZM and
                                                         CCU6 PM                                                               */
    } bit;                                          /*!< [7] BitSize                                                           */
  } T3_TRIGG_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006004) Timer 3 Compare Value                                  */
    
    struct {
      __IO uint32_t  LO         :  8;               /*!< [0..7] Timer 3 Compare Value Low Byte                                 */
      __IO uint32_t  HI         :  8;               /*!< [8..15] Timer 3 Compare Value High Byte                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CMP;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006008) Timer 3                                                */
    
    struct {
      __IO uint32_t  LO         :  8;               /*!< [0..7] Timer 3 Low Register or Preload Value                          */
      __IO uint32_t  HI         :  8;               /*!< [8..15] Timer 3 High Register or Preload Value                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CNT;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4800600C) Timer 3 Control Register                               */
    
    struct {
      __IO uint32_t  T3_PD_N    :  1;               /*!< [0..0] Timer 3 Power Down                                             */
      __IO uint32_t  T3_RD_REQ  :  1;               /*!< [1..1] Timer 3 Value Read Request                                     */
      __IO uint32_t  T3_RD_REQ_CONF:  1;            /*!< [2..2] Timer 3 Read Mode                                              */
      __IO uint32_t  CNT_RDY    :  1;               /*!< [3..3] Timer 3 Count Ready                                            */
      __IO uint32_t  TR3H       :  1;               /*!< [4..4] Timer 3 Run Control (High Byte Timer)                          */
      __I  uint32_t  T3H_OVF_STS:  1;               /*!< [5..5] Timer 3 Overflow Flag (High Byte Timer)                        */
      __IO uint32_t  TR3L       :  1;               /*!< [6..6] Timer 3 Run Control (Low Byte Timer)                           */
      __I  uint32_t  T3L_OVF_STS:  1;               /*!< [7..7] Timer 3 Overflow Flag (Low Byte Timer)                         */
      __IO uint32_t  T3L_OVF_IE :  1;               /*!< [8..8] Timer 3 Overflow Interrupt Enable (Low Byte Timer)             */
      __IO uint32_t  T3H_OVF_IE :  1;               /*!< [9..9] Timer 3 Overflow Interrupt Enable (High Byte Timer)            */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006010) Timer 3 Mode Configuration Register                    */
    
