alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  T3M        :  2;               /*!< [0..1] Mode Select Bits                                               */
           uint32_t             :  4;
      __IO uint32_t  T3_SUBM    :  2;               /*!< [6..7] Sub-Mode Select Bits                                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODE_CONF;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x48006014) Timer 3 Interrupt Status Clear Register                */
    
    struct {
           uint32_t             :  5;
      __O  uint32_t  T3H_OVF_ICLR:  1;              /*!< [5..5] Timer 3 Overflow Flag (High Byte Timer) Interrupt Clear        */
           uint32_t             :  1;
      __O  uint32_t  T3L_OVF_ICLR:  1;              /*!< [7..7] Timer 3 Overflow Flag (Low Byte Timer) Interrupt Clear         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } ISRCLR;
} TIMER3_Type;


/* ================================================================================ */
/* ================                       LIN                      ================ */
/* ================================================================================ */


/**
  * @brief LIN (LIN)
  */

typedef struct {                                    /*!< (@ 0x4801E000) LIN Structure                                          */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801E000) LIN Transceiver Control and Status                     */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  MODE       :  2;               /*!< [1..2] LIN transceiver power mode control                             */
      __I  uint32_t  M_SM_ERR   :  1;               /*!< [3..3] LIN Transceiver Mode or Slope Mode Error                       */
      __I  uint32_t  OT_STS     :  1;               /*!< [4..4] LIN Receiver Overtemperature Status                            */
      __I  uint32_t  OC_STS     :  1;               /*!< [5..5] LIN Receiver Overcurrent Status                                */
      __I  uint32_t  TXD_TMOUT_STS:  1;             /*!< [6..6] LIN TXD time-out status                                        */
           uint32_t             :  2;
      __IO uint32_t  TXD        :  1;               /*!< [9..9] LIN Transmitter switch on (only used when LIN_HV_MODE
                                                         is set)                                                               */
      __I  uint32_t  RXD        :  1;               /*!< [10..10] Output Signal of Receiver                                    */
      __IO uint32_t  SM         :  2;               /*!< [11..12] LIN Transmitter Slope mode control                           */
      __I  uint32_t  FB_SM1     :  1;               /*!< [13..13] Feedback Signal 1 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM2     :  1;               /*!< [14..14] Feedback Signal 2 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM3     :  1;               /*!< [15..15] Feedback Signal 3 for Slope Mode Setting                     */
      __I  uint32_t  MODE_FB    :  3;               /*!< [16..18] Feedback Signals for LIN Transmitter Mode Settings           */
           uint32_t             :  2;
      __IO uint32_t  HV_MODE    :  1;               /*!< [21..21] LIN Transceiver High Voltage Input - Output Mode             */
           uint32_t             :  2;
      __O  uint32_t  M_SM_ERR_CLR:  1;              /*!< [24..24] LIN Transceiver Mode or Slope Mode Error Clear               */
    } bit;                                          /*!< [25] BitSize                                                          */
  } CTRL_STS;
} LIN_Type;


/* ================================================================================ */
/* ================                       MF                       ================ */
/* ================================================================================ */


/**
  * @brief MF (MF)
  */

typedef struct {                                    /*!< (@ 0x48018000) MF Structure                                           */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018000) Port 2 ADC Selection Control Register                  */
    
    struct {
           uint32_t             : 10;
      __IO uint32_t  ADC1_CH1_SEL:  1;              /*!< [10..10] ADC1 Channel 1 Input Selection                               */
    } bit;                                          /*!< [11] BitSize                                                          */
  } P2_ADCSEL_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018004) Supply Sense Control Register                          */
    
    struct {
      __IO uint32_t  VMON_SEN_PD_N:  1;             /*!< [0..0] Monitoring Input Attenuator enable                             */
           uint32_t             :  3;
      __IO uint32_t  VMON_SEN_HRESO_5V:  1;         /*!< [4..4] Monitoring Input Attenuator High Impedance Output Control      */
      __IO uint32_t  VMON_SEN_SEL_INRANGE:  1;      /*!< [5..5] Monitoring Input Attenuator Select Inputrange                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } VMON_SEN_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018008) BEMF Comparator Control Status Register                */
    
    struct {
      __IO uint32_t  PHUCOMP_EN :  1;               /*!< [0..0] Phase U Comparator enable                                      */
      __IO uint32_t  PHVCOMP_EN :  1;               /*!< [1..1] Phase V Comparator enable                                      */
      __IO uint32_t  PHWCOMP_EN :  1;               /*!< [2..2] Phase W Comparator enable                                      */
      __IO uint32_t  DEMGFILTDIS:  1;               /*!< [3..3] BEMF Comparator Demagnetisation (Demag) Filter Disable         */
      __IO uint32_t  FILTBYPS   :  1;               /*!< [4..4] BEMF Comparator Output Filter Bypass                           */
      __IO uint32_t  GPT12CAPINB:  1;               /*!< [5..5] GPT12 CAPINB Value                                             */
           uint32_t             :  2;
      __IO uint32_t  PHUCOMP_ON :  1;               /*!< [8..8] Phase U Comparator on                                          */
      __IO uint32_t  PHVCOMP_ON :  1;               /*!< [9..9] Phase V Comparator on                                          */
      __IO uint32_t  PHWCOMP_ON :  1;               /*!< [10..10] Phase W Comparator on                                        */
           uint32_t             :  1;
      __IO uint32_t  CCPOS_INSEL:  1;               /*!< [12..12] CCPOSx_3 INSEL select, x = 0,1,2                             */
           uint32_t             :  3;
      __I  uint32_t  PHU_ZC_STS :  1;               /*!< [16..16] Phase U Comparator zero crossing status                      */
      __I  uint32_t  PHV_ZC_STS :  1;               /*!< [17..17] Phase V Comparator zero crossing status                      */
      __I  uint32_t  PHW_ZC_STS :  1;               /*!< [18..18] Phase W Comparator zero crossing status                      */
    } bit;                                          /*!< [19] BitSize                                                          */
  } BEMFC_CTRL_STS;
  __I  uint32_t  RESERVED0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x48018010) Temperature Sensor Control Register                    */
    
