alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  SQ1_int    :  4;               /*!< [0..3] Sequence 1 channel enable                                      */
      __I  uint32_t  SQ2_int    :  4;               /*!< [4..7] Sequence 2 channel enable                                      */
      __I  uint32_t  SQ3_int    :  4;               /*!< [8..11] Sequence 3 channel enable                                     */
      __I  uint32_t  SQ4_int    :  4;               /*!< [12..15] Sequence 4 channel enable                                    */
      __I  uint32_t  SQ5_int    :  4;               /*!< [16..19] Sequence 5 channel enable                                    */
      __I  uint32_t  SQ6_int    :  4;               /*!< [20..23] Sequence 6 channel enable                                    */
      __I  uint32_t  SQ7_int    :  4;               /*!< [24..27] Sequence 7 channel enable                                    */
      __I  uint32_t  SQ8_int    :  4;               /*!< [28..31] Sequence 8 channel enable                                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SQ1_8_int;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C030) Measurement Channel Enable Bits for Cycle 9 and
                                                         10                                                                    */
    
    struct {
      __I  uint32_t  SQ9_int    :  4;               /*!< [0..3] Sequence 9 channel enable                                      */
      __I  uint32_t  SQ10_int   :  4;               /*!< [4..7] Sequence 10 channel enable                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SQ9_10_int;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C034) Calibration for Channel 0 & 1                          */
    
    struct {
      __IO uint32_t  OFFS_CH0   :  8;               /*!< [0..7] Offset Calibration for channel 0                               */
      __IO uint32_t  GAIN_CH0   :  8;               /*!< [8..15] Gain Calibration for channel 0                                */
      __IO uint32_t  OFFS_CH1   :  8;               /*!< [16..23] Offset Calibration for channel 1                             */
      __IO uint32_t  GAIN_CH1   :  8;               /*!< [24..31] Gain Calibration for channel 1                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH0_1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C038) Calibration for Channel 2 & 3                          */
    
    struct {
      __IO uint32_t  OFFS_CH2   :  8;               /*!< [0..7] Offset Calibration for channel 2                               */
      __IO uint32_t  GAIN_CH2   :  8;               /*!< [8..15] Gain Calibration for channel 2                                */
      __IO uint32_t  OFFS_CH3   :  8;               /*!< [16..23] Offset Calibration for channel 3                             */
      __IO uint32_t  GAIN_CH3   :  8;               /*!< [24..31] Gain Calibration for channel 3                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH2_3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C03C) Calibration for Channel 4 & 5                          */
    
    struct {
      __IO uint32_t  OFFS_CH4   :  8;               /*!< [0..7] Offset Calibration for channel 4                               */
      __IO uint32_t  GAIN_CH4   :  8;               /*!< [8..15] Gain Calibration for channel 4                                */
      __IO uint32_t  OFFS_CH5   :  8;               /*!< [16..23] Offset Calibration for channel 5                             */
      __IO uint32_t  GAIN_CH5   :  8;               /*!< [24..31] Gain Calibration for channel 5                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH4_5;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C040) Calibration for Channel 6 & 7                          */
    
    struct {
      __I  uint32_t  OFFS_CH6   :  8;               /*!< [0..7] Offset Calibration for channel 6                               */
      __I  uint32_t  GAIN_CH6   :  8;               /*!< [8..15] Gain Calibration for channel 6                                */
      __I  uint32_t  OFFS_CH7   :  8;               /*!< [16..23] Offset Calibration for channel 7                             */
      __I  uint32_t  GAIN_CH7   :  8;               /*!< [24..31] Gain Calibration for channel 7                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH6_7;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C044) Calibration for Channel 8 & 9                          */
    
    struct {
      __I  uint32_t  OFFS_CH8   :  8;               /*!< [0..7] Offset Calibration for channel 8                               */
      __I  uint32_t  GAIN_CH8   :  8;               /*!< [8..15] Gain Calibration for channel 8                                */
      __I  uint32_t  OFFS_CH9   :  8;               /*!< [16..23] Offset Calibration for channel 9                             */
      __I  uint32_t  GAIN_CH9   :  8;               /*!< [24..31] Gain Calibration for channel 9                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH8_9;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C048) Filter Coefficients ADC Channel 0-5                    */
    
