alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  Ch0_EN     :  1;               /*!< [0..0] Upper threshold IIR filter enable ch 0                         */
      __IO uint32_t  Ch1_EN     :  1;               /*!< [1..1] Upper threshold IIR filter enable ch 1                         */
      __IO uint32_t  Ch2_EN     :  1;               /*!< [2..2] Upper threshold IIR filter enable ch 2                         */
      __IO uint32_t  Ch3_EN     :  1;               /*!< [3..3] Upper threshold IIR filter enable ch 3                         */
      __IO uint32_t  Ch4_EN     :  1;               /*!< [4..4] Upper threshold IIR filter enable ch 4                         */
      __IO uint32_t  Ch5_EN     :  1;               /*!< [5..5] Upper threshold IIR filter enable ch 5                         */
    } bit;                                          /*!< [6] BitSize                                                           */
  } FILT_UP_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C07C) Lower Threshold Filter Enable                          */
    
    struct {
      __IO uint32_t  Ch0_EN     :  1;               /*!< [0..0] Lower threshold IIR filter enable ch 0                         */
      __IO uint32_t  Ch1_EN     :  1;               /*!< [1..1] Lower threshold IIR filter enable ch 1                         */
      __IO uint32_t  Ch2_EN     :  1;               /*!< [2..2] Lower threshold IIR filter enable ch 2                         */
      __IO uint32_t  Ch3_EN     :  1;               /*!< [3..3] Lower threshold IIR filter enable ch 3                         */
      __IO uint32_t  Ch4_EN     :  1;               /*!< [4..4] Lower threshold IIR filter enable ch 4                         */
      __IO uint32_t  Ch5_EN     :  1;               /*!< [5..5] Lower threshold IIR filter enable ch 5                         */
    } bit;                                          /*!< [6] BitSize                                                           */
  } FILT_LO_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C080) Lower Comparator Trigger Level Channel 0 -3            */
    
    struct {
      __IO uint32_t  CH0        :  8;               /*!< [0..7] Channel 0 lower trigger level                                  */
      __IO uint32_t  CH1        :  8;               /*!< [8..15] Channel 1 lower trigger level                                 */
      __IO uint32_t  CH2        :  8;               /*!< [16..23] Channel 2 lower trigger level                                */
      __IO uint32_t  CH3        :  8;               /*!< [24..31] Channel 3 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C084) Lower Comparator Trigger Level Channel 4 & 5           */
    
    struct {
      __IO uint32_t  CH4        :  8;               /*!< [0..7] Channel 4 lower trigger level                                  */
      __IO uint32_t  CH5        :  8;               /*!< [8..15] Channel 5 lower trigger level                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TH4_5_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C088) Lower Comparator Trigger Level Channel 6 -9            */
    
    struct {
      __IO uint32_t  CH6        :  8;               /*!< [0..7] Channel 6 lower trigger level                                  */
      __I  uint32_t  CH7        :  8;               /*!< [8..15] Channel 7 lower trigger level                                 */
      __IO uint32_t  CH8        :  8;               /*!< [16..23] Channel 8 lower trigger level                                */
      __IO uint32_t  CH9        :  8;               /*!< [24..31] Channel 9 lower trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH6_9_LOWER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C08C) Upper Comparator Trigger Level Channel 0-3             */
    
    struct {
      __IO uint32_t  CH0        :  8;               /*!< [0..7] Channel 0 upper trigger level                                  */
      __IO uint32_t  CH1        :  8;               /*!< [8..15] Channel 1 upper trigger level                                 */
      __IO uint32_t  CH2        :  8;               /*!< [16..23] Channel 2 upper trigger level                                */
      __IO uint32_t  CH3        :  8;               /*!< [24..31] Channel 3 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH0_3_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C090) Upper Comparator Trigger Level Channel 4 -5            */
    
    struct {
      __IO uint32_t  CH4        :  8;               /*!< [0..7] Channel 4 upper trigger level                                  */
      __IO uint32_t  CH5        :  8;               /*!< [8..15] Channel 5 upper trigger level                                 */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TH4_5_UPPER;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C094) Upper Comparator Trigger Level Channel 6 -9            */
    
    struct {
      __I  uint32_t  CH6        :  8;               /*!< [0..7] Channel 6 upper trigger level                                  */
      __I  uint32_t  CH7        :  8;               /*!< [8..15] Channel 7 upper trigger level                                 */
      __I  uint32_t  CH8        :  8;               /*!< [16..23] Channel 8 upper trigger level                                */
      __I  uint32_t  CH9        :  8;               /*!< [24..31] Channel 9 upper trigger level                                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } TH6_9_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C098) Lower Counter Trigger Level Channel 0 - 3              */
    
