alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __I  uint32_t  CNT_UP_CH6 :  3;               /*!< [0..2] Upper timer trigger threshold channel 6                        */
      __I  uint32_t  HYST_UP_CH6:  2;               /*!< [3..4] Channel 6 upper hysteresis                                     */
           uint32_t             :  3;
      __I  uint32_t  CNT_UP_CH7 :  3;               /*!< [8..10] Upper timer trigger threshold channel 7                       */
      __I  uint32_t  HYST_UP_CH7:  2;               /*!< [11..12] Channel 7 upper hysteresis                                   */
           uint32_t             :  3;
      __I  uint32_t  CNT_UP_CH8 :  3;               /*!< [16..18] Upper timer trigger threshold channel 8                      */
      __I  uint32_t  HYST_UP_CH8:  2;               /*!< [19..20] Channel 8 upper hysteresis                                   */
           uint32_t             :  3;
      __I  uint32_t  CNT_UP_CH9 :  3;               /*!< [24..26] Upper timer trigger threshold channel 9                      */
      __I  uint32_t  HYST_UP_CH9:  2;               /*!< [27..28] Channel 9 upper hysteresis                                   */
    } bit;                                          /*!< [29] BitSize                                                          */
  } CNT6_9_UPPER;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C0B0) Overvoltage Measurement Mode of Ch 0-5                 */
    
    struct {
      __IO uint32_t  Ch0        :  2;               /*!< [0..1] Measurement mode ch 0                                          */
      __IO uint32_t  Ch1        :  2;               /*!< [2..3] Measurement mode ch 1                                          */
      __IO uint32_t  Ch2        :  2;               /*!< [4..5] Measurement mode ch 2                                          */
      __IO uint32_t  Ch3        :  2;               /*!< [6..7] Measurement mode ch 3                                          */
      __IO uint32_t  Ch4        :  2;               /*!< [8..9] Measurement mode ch 4                                          */
      __IO uint32_t  Ch5        :  2;               /*!< [10..11] Measurement mode ch 5                                        */
    } bit;                                          /*!< [12] BitSize                                                          */
  } MMODE0_5;
  __I  uint32_t  RESERVED1[2];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C0BC) ADC2 HV Status Register                                */
    
    struct {
           uint32_t             :  1;
      __I  uint32_t  READY      :  1;               /*!< [1..1] HVADC Ready bit                                                */
    } bit;                                          /*!< [2] BitSize                                                           */
  } HV_STS;
} ADC2_Type;


/* ================================================================================ */
/* ================                      ADC1                      ================ */
/* ================================================================================ */


/**
  * @brief ADC1 (ADC1)
  */

typedef struct {                                    /*!< (@ 0x40004000) ADC1 Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004000) ADC1 Control and Status Register                       */
    
    struct {
      __IO uint32_t  PD_N       :  1;               /*!< [0..0] ADC1 Power Down Signal                                         */
           uint32_t             :  1;
      __IO uint32_t  SOC        :  1;               /*!< [2..2] ADC1 Start of Conversion (software mode)                       */
      __I  uint32_t  EOC        :  1;               /*!< [3..3] ADC1 End of Conversion (software mode)                         */
      __IO uint32_t  IN_MUX_SEL :  3;               /*!< [4..6] Channel for software mode                                      */
    } bit;                                          /*!< [7] BitSize                                                           */
  } CTRL_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004004) Global Control Register                                */
    
    struct {
      __IO uint32_t  DIVA       :  6;               /*!< [0..5] Divide Factor for the Analog internal clock: 0x00=Fadci
                                                         = Fadc, 0x01=Fadci = Fadc/2, 0x02=Fadci = Fadc/3, 0x02=...,
                                                          0x3F=Fadci = Fadc/64,                                                */
           uint32_t             :  2;
      __IO uint32_t  ANON       :  2;               /*!< [8..9] Analog Part Switched On                                        */
    } bit;                                          /*!< [10] BitSize                                                          */
  } GLOBCTR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004008) Channel Settings Bits for Exceptional Interrupt
                                                         Measurement                                                           */
    
    struct {
      __IO uint32_t  CHx        :  3;               /*!< [0..2] Channel set for exceptional interrupt measurement (EIM)        */
           uint32_t             :  1;
      __IO uint32_t  REP        :  3;               /*!< [4..6] Repeat count for exceptional interrupt measurement (EIM)       */
           uint32_t             :  9;
      __IO uint32_t  TRIG_SEL   :  3;               /*!< [16..18] Trigger selection for exceptional interrupt measurement
                                                         (EIM)                                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } CHx_EIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000400C) Channel Settings Bits for Exceptional Sequence
                                                         Measurement                                                           */
    
