alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  ESM_0      :  8;               /*!< [0..7] Channel Sequence for Exceptional Sequence Measurement
                                                         (ESM)                                                                 */
           uint32_t             :  8;
      __IO uint32_t  TRIG_SEL   :  3;               /*!< [16..18] Trigger selection for exceptional interrupt measurement
                                                         (ESM)                                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } CHx_ESM;
  __I  uint32_t  RESERVED0[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004018) Measurement Channel Enable Bits for Cycle 1 -
                                                         4                                                                     */
    
    struct {
      __IO uint32_t  SQ1        :  8;               /*!< [0..7] Sequence 1 channel enable                                      */
      __IO uint32_t  SQ2        :  8;               /*!< [8..15] Sequence 2 channel enable                                     */
      __IO uint32_t  SQ3        :  8;               /*!< [16..23] Sequence 3 channel enable                                    */
      __IO uint32_t  SQ4        :  8;               /*!< [24..31] Sequence 4 channel enable                                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SQ1_4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000401C) Measurement Channel Enable Bits for Cycle 5 -
                                                         8                                                                     */
    
    struct {
      __IO uint32_t  SQ5        :  8;               /*!< [0..7] Sequence 5 channel enable                                      */
      __IO uint32_t  SQ6        :  8;               /*!< [8..15] Sequence 6 channel enable                                     */
      __IO uint32_t  SQ7        :  8;               /*!< [16..23] Sequence 7 channel enable                                    */
      __IO uint32_t  SQ8        :  8;               /*!< [24..31] Sequence 8 channel enable                                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SQ5_8;
  __I  uint32_t  RESERVED1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004024) Measurement Channel Data Width Selection               */
    
    struct {
      __IO uint32_t  ch0        :  1;               /*!< [0..0] Data Width channel 0                                           */
      __IO uint32_t  ch1        :  1;               /*!< [1..1] Data Width channel 1                                           */
      __IO uint32_t  ch2        :  1;               /*!< [2..2] Data Width channel 2                                           */
      __IO uint32_t  ch3        :  1;               /*!< [3..3] Data Width channel 3                                           */
      __IO uint32_t  ch4        :  1;               /*!< [4..4] Data Width channel 4                                           */
      __IO uint32_t  ch5        :  1;               /*!< [5..5] Data Width channel 5                                           */
      __IO uint32_t  ch6        :  1;               /*!< [6..6] Data Width channel 6                                           */
      __IO uint32_t  ch7        :  1;               /*!< [7..7] Data Width channel 7                                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DWSEL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004028) Measurement Channel Sample Time Control 0 - 3          */
    
    struct {
      __IO uint32_t  ch0        :  8;               /*!< [0..7] Sample Time Control for Channel 0                              */
      __IO uint32_t  ch1        :  8;               /*!< [8..15] Sample Time Control for Channel 1                             */
      __IO uint32_t  ch2        :  8;               /*!< [16..23] Sample Time Control for Channel 2                            */
      __IO uint32_t  ch3        :  8;               /*!< [24..31] Sample Time Control for Channel 3                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } STC_0_3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000402C) Measurement Channel Sample Time Control 4 - 7          */
    
    struct {
      __IO uint32_t  ch4        :  8;               /*!< [0..7] Sample Time Control for Channel 4                              */
      __IO uint32_t  ch5        :  8;               /*!< [8..15] Sample Time Control for Channel 5                             */
      __IO uint32_t  ch6        :  8;               /*!< [16..23] Sample Time Control for Channel 6                            */
      __IO uint32_t  ch7        :  8;               /*!< [24..31] Sample Time Control for Channel 7                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } STC_4_7;
  __I  uint32_t  RESERVED2[4];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004040) ADC1 Output Channel EIM                                */
    
    struct {
      __I  uint32_t  OUT_CH_EIM : 12;               /*!< [0..11] ADC1 output result value EIM                                  */
           uint32_t             :  4;
      __IO uint32_t  WFR8       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF8        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF8        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT_EIM;
  __I  uint32_t  RESERVED3[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004050) Sequencer Feedback Register                            */
    
