alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  LS1_EN     :  1;               /*!< [0..0] Low Side Driver 1 Enable                                       */
      __IO uint32_t  LS1_PWM    :  1;               /*!< [1..1] Low Side Driver 1 PWM Enable                                   */
      __IO uint32_t  LS1_ON     :  1;               /*!< [2..2] Low Side Driver 1 On                                           */
      __IO uint32_t  LS1_DCS_EN :  1;               /*!< [3..3] Low Side Driver 1 Diagnosis Current Source Enable              */
      __I  uint32_t  LS1_DS_STS :  1;               /*!< [4..4] Low Side Driver 1 Drain Source Monitoring Status in OFF-State  */
      __I  uint32_t  LS1_SUPERR_STS:  1;            /*!< [5..5] Low Side Driver 1 Supply Error Status                          */
      __I  uint32_t  LS1_OC_STS :  1;               /*!< [6..6] External Low Side 1 FET Over-current Status                    */
      __IO uint32_t  LS1_OC_DIS :  1;               /*!< [7..7] Low Side Driver 1 Overcurrent Shutdown Disable                 */
      __IO uint32_t  LS2_EN     :  1;               /*!< [8..8] Low Side Driver 2 Enable                                       */
      __IO uint32_t  LS2_PWM    :  1;               /*!< [9..9] Low Side Driver 2 PWM Enable                                   */
      __IO uint32_t  LS2_ON     :  1;               /*!< [10..10] Low Side Driver 2 On                                         */
      __IO uint32_t  LS2_DCS_EN :  1;               /*!< [11..11] Low Side Driver 2 Diagnosis Current Source Enable            */
      __I  uint32_t  LS2_DS_STS :  1;               /*!< [12..12] Low Side Driver 2 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  LS2_SUPERR_STS:  1;            /*!< [13..13] Low Side Driver 2 Supply Error Status                        */
      __I  uint32_t  LS2_OC_STS :  1;               /*!< [14..14] External Low Side 2 FET Over-current Status                  */
      __IO uint32_t  LS2_OC_DIS :  1;               /*!< [15..15] Low Side Driver Overcurrent Shutdown Disable                 */
      __IO uint32_t  HS1_EN     :  1;               /*!< [16..16] High Side Driver 1 Enable                                    */
      __IO uint32_t  HS1_PWM    :  1;               /*!< [17..17] High Side Driver 1 PWM Enable                                */
      __IO uint32_t  HS1_ON     :  1;               /*!< [18..18] High Side Driver 1 On                                        */
      __IO uint32_t  HS1_DCS_EN :  1;               /*!< [19..19] High Side Driver 1 Diagnosis Current Source Enable           */
      __I  uint32_t  HS1_DS_STS :  1;               /*!< [20..20] High Side Driver 1 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  HS1_SUPERR_STS:  1;            /*!< [21..21] High Side Driver 1 Supply Error Status                       */
      __I  uint32_t  HS1_OC_STS :  1;               /*!< [22..22] External High Side 1 FET Over-current Status                 */
      __IO uint32_t  HS1_OC_DIS :  1;               /*!< [23..23] High Side Driver Overcurrent Shutdown Disable                */
      __IO uint32_t  HS2_EN     :  1;               /*!< [24..24] High Side Driver 2 Enable                                    */
      __IO uint32_t  HS2_PWM    :  1;               /*!< [25..25] High Side Driver 2 PWM Enable                                */
      __IO uint32_t  HS2_ON     :  1;               /*!< [26..26] High Side Driver 2 On                                        */
      __IO uint32_t  HS2_DCS_EN :  1;               /*!< [27..27] High Side Driver 2 Diagnosis Current Source Enable           */
      __I  uint32_t  HS2_DS_STS :  1;               /*!< [28..28] High Side Driver 2 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  HS2_SUPERR_STS:  1;            /*!< [29..29] High Side Driver 2 Supply Error Status                       */
      __I  uint32_t  HS2_OC_STS :  1;               /*!< [30..30] External High Side 2 FET Over-current Status                 */
      __IO uint32_t  HS2_OC_DIS :  1;               /*!< [31..31] High Side Driver Overcurrent Shutdown Disable                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034004) H-Bridge Driver Control 2                              */
    
    struct {
      __IO uint32_t  LS3_EN     :  1;               /*!< [0..0] Low Side Driver 3 Enable                                       */
      __IO uint32_t  LS3_PWM    :  1;               /*!< [1..1] Low Side Driver 3 PWM Enable                                   */
      __IO uint32_t  LS3_ON     :  1;               /*!< [2..2] Low Side Driver 3 On                                           */
      __IO uint32_t  LS3_DCS_EN :  1;               /*!< [3..3] Low Side Driver 3 Diagnosis Current Source Enable              */
      __I  uint32_t  LS3_DS_STS :  1;               /*!< [4..4] Low Side Driver 3 Drain Source Monitoring Status in OFF-State  */
      __I  uint32_t  LS3_SUPERR_STS:  1;            /*!< [5..5] Low Side Driver 3 Supply Error Status                          */
      __I  uint32_t  LS3_OC_STS :  1;               /*!< [6..6] External Low Side 3 FET Over-current Status                    */
      __IO uint32_t  LS3_OC_DIS :  1;               /*!< [7..7] Low Side Driver 3 Over-current Shutdown Disable                */
      __IO uint32_t  HS3_EN     :  1;               /*!< [8..8] High Side Driver 3 Enable                                      */
      __IO uint32_t  HS3_PWM    :  1;               /*!< [9..9] High Side Driver 3 PWM Enable                                  */
      __IO uint32_t  HS3_ON     :  1;               /*!< [10..10] High Side Driver 3 On                                        */
      __IO uint32_t  HS3_DCS_EN :  1;               /*!< [11..11] High Side Driver 3 Diagnosis Current Source Enable           */
      __I  uint32_t  HS3_DS_STS :  1;               /*!< [12..12] High Side Driver 3 Drain Source Monitoring Status            */
      __I  uint32_t  HS3_SUPERR_STS:  1;            /*!< [13..13] High Side Driver 3 Supply Error Status                       */
      __I  uint32_t  HS3_OC_STS :  1;               /*!< [14..14] External High Side 3 FET Over-current Status                 */
      __IO uint32_t  HS3_OC_DIS :  1;               /*!< [15..15] High Side Driver 3 Over-current Shutdown Disable             */
      __I  uint32_t  DLY_DIAG_TIM: 10;              /*!< [16..25] Ext. power on/off diag timer result register                 */
      __O  uint32_t  DLY_DIAG_SCLR:  1;             /*!< [26..26] Ext. power diag timer valid flag clear                       */
      __I  uint32_t  DLY_DIAG_STS:  1;              /*!< [27..27] Ext. power diag timer valid flag                             */
      __IO uint32_t  DLY_DIAG_CHSEL:  3;            /*!< [28..30] Ext. power on/off timer channel select                       */
      __IO uint32_t  DLY_DIAG_DIRSEL:  1;           /*!< [31..31] Ext. power diag timer on / off select                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034008) H-Bridge Driver Control 3                              */
    
