alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
    struct {
      __IO uint32_t  ICHARGE_TRIM:  5;              /*!< [0..4] Trimming of the internal driver charge current                 */
           uint32_t             :  1;
      __IO uint32_t  ICHARGEDIV2_N:  1;             /*!< [6..6] ICHARGE Current divide by 2 not                                */
      __IO uint32_t  ON_SEQ_EN  :  1;               /*!< [7..7] Turn On SlewrateSequencer enable                               */
      __IO uint32_t  IDISCHARGE_TRIM:  5;           /*!< [8..12] Trimming of the internal driver dis-charge current            */
           uint32_t             :  1;
      __IO uint32_t  IDISCHARGEDIV2_N:  1;          /*!< [14..14] IDISCHARGE Current divide by 2 not                           */
      __IO uint32_t  OFF_SEQ_EN :  1;               /*!< [15..15] Turn Off Slewrate Sequencer enable                           */
      __IO uint32_t  DSMONVTH   :  3;               /*!< [16..18] Voltage Threshold for Drain-Source Monitoring of external
                                                         FETs                                                                  */
           uint32_t             :  5;
      __IO uint32_t  DRV_CCP_TIMSEL:  2;            /*!< [24..25] minimum cross conduction protection time setting             */
      __IO uint32_t  DRV_CCP_DIS:  1;               /*!< [26..26] Dynamic cross conduction protection Disable                  */
           uint32_t             :  3;
      __O  uint32_t  SEQ_ERR_SCLR:  1;              /*!< [30..30] Driver Sequence Error Status Clear                           */
      __I  uint32_t  SEQ_ERR_STS:  1;               /*!< [31..31] Driver Sequence Error Status                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL3;
  __I  uint32_t  RESERVED0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034010) Turn on Slewrate Sequencer Control                     */
    
    struct {
      __IO uint32_t  DRV_OFF_t_4:  3;               /*!< [0..2] Slew rate sequencer off phase 4 time                           */
      __IO uint32_t  DRV_OFF_I_4:  5;               /*!< [3..7] Slew rate sequencer off phase 4 current                        */
      __IO uint32_t  DRV_OFF_t_3:  3;               /*!< [8..10] Slew rate sequencer off phase 3 time                          */
      __IO uint32_t  DRV_OFF_I_3:  5;               /*!< [11..15] Slew rate sequencer off phase 3 current                      */
      __IO uint32_t  DRV_OFF_t_2:  3;               /*!< [16..18] Slew rate sequencer off phase 2 time                         */
      __IO uint32_t  DRV_OFF_I_2:  5;               /*!< [19..23] Slew rate sequencer off phase 2 current                      */
      __IO uint32_t  DRV_OFF_t_1:  3;               /*!< [24..26] Slew rate sequencer off phase 1 time                         */
      __IO uint32_t  DRV_OFF_I_1:  5;               /*!< [27..31] Slew rate sequencer off phase 1 current                      */
    } bit;                                          /*!< [32] BitSize                                                          */
  } OFF_SEQ_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034014) Turn off Slewrate Sequencer Control                    */
    
    struct {
      __IO uint32_t  DRV_ON_t_4 :  3;               /*!< [0..2] Slew rate sequencer on phase 4 time                            */
      __IO uint32_t  DRV_ON_I_4 :  5;               /*!< [3..7] Slew rate sequencer on phase 4 current                         */
      __IO uint32_t  DRV_ON_t_3 :  3;               /*!< [8..10] Slew rate sequencer on phase 3 time                           */
      __IO uint32_t  DRV_ON_I_3 :  5;               /*!< [11..15] Slew rate sequencer on phase 3 current                       */
      __IO uint32_t  DRV_ON_t_2 :  3;               /*!< [16..18] Slew rate sequencer on phase 2 time                          */
      __IO uint32_t  DRV_ON_I_2 :  5;               /*!< [19..23] Slew rate sequencer on phase 2 current                       */
      __IO uint32_t  DRV_ON_t_1 :  3;               /*!< [24..26] Slew rate sequencer on phase 1 time                          */
      __IO uint32_t  DRV_ON_I_1 :  5;               /*!< [27..31] Slew rate sequencer on phase 1 current                       */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ON_SEQ_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034018) Trimming of Driver                                     */
    
    struct {
      __IO uint32_t  LS_HS_BT_TFILT_SEL:  2;        /*!< [0..1] Blanking Time for Drain-Source Monitoring of Low / High
                                                         Side Drivers                                                          */
           uint32_t             :  6;
      __IO uint32_t  LSDRV_DS_TFILT_SEL:  2;        /*!< [8..9] Filter Time for Drain-Source Monitoring of Low Side Drivers    */
      __IO uint32_t  LS1DRV_FDISCHG_DIS:  1;        /*!< [10..10] Low Side 1 Predriver in overcurrent situation disable        */
      __IO uint32_t  LS2DRV_FDISCHG_DIS:  1;        /*!< [11..11] Low Side 2 Predriver in overcurrent situation disable        */
      __IO uint32_t  LS3DRV_FDISCHG_DIS:  1;        /*!< [12..12] Low Side 3 Predriver in overcurrent situation disable        */
      __IO uint32_t  LS1DRV_OCSDN_DIS:  1;          /*!< [13..13] Low Side 1 Predriver in overcurrent situation disable        */
      __IO uint32_t  LS2DRV_OCSDN_DIS:  1;          /*!< [14..14] Low Side 2 Predriver in overcurrent situation disable        */
      __IO uint32_t  LS3DRV_OCSDN_DIS:  1;          /*!< [15..15] Low Side 3 Predriver in overcurrent situation disable        */
      __IO uint32_t  HSDRV_DS_TFILT_SEL:  2;        /*!< [16..17] Filter Time for Drain-Source Monitoring of High Side
                                                         Drivers                                                               */
      __IO uint32_t  HS1DRV_FDISCHG_DIS:  1;        /*!< [18..18] High Side 1 Predriver in overcurrent situation disable       */
      __IO uint32_t  HS2DRV_FDISCHG_DIS:  1;        /*!< [19..19] High Side 2 Predriver in overcurrent situation disable       */
      __IO uint32_t  HS3DRV_FDISCHG_DIS:  1;        /*!< [20..20] High Side 3 Predriver in overcurrent situation disable       */
      __IO uint32_t  HS1DRV_OCSDN_DIS:  1;          /*!< [21..21] High Side 1 Predriver in overcurrent situation disable       */
      __IO uint32_t  HS2DRV_OCSDN_DIS:  1;          /*!< [22..22] High Side 2 Predriver in overcurrent situation disable       */
      __IO uint32_t  HS3DRV_OCSDN_DIS:  1;          /*!< [23..23] High Side 3 Predriver in overcurrent situation disable       */
      __IO uint32_t  CPLOW_TFILT_SEL:  2;           /*!< [24..25] Filter Time for Charge Pump Voltage Low Diagnosis            */
    } bit;                                          /*!< [26] BitSize                                                          */
  } TRIM_DRVx;
  __I  uint32_t  RESERVED1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034020) Charge Pump Control and Status Register                */
    
