alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE987x_series/Include/TLE987x.h
#define SCU_BASE                        0x50005000UL
#define PORT_BASE                       0x48028000UL
#define GPT12E_BASE                     0x40010000UL
#define TIMER2_BASE                     0x48004000UL
#define TIMER21_BASE                    0x48005000UL
#define CCU6_BASE                       0x4000C000UL
#define UART1_BASE                      0x48020000UL
#define UART2_BASE                      0x48022000UL
#define SSC1_BASE                       0x48024000UL
#define SSC2_BASE                       0x48026000UL
#define PMU_BASE                        0x50004000UL
#define SCUPM_BASE                      0x50006000UL
#define CPU_BASE                        0xE000E000UL
#define DMA_BASE                        0x50014000UL
#define TIMER3_BASE                     0x48006000UL
#define LIN_BASE                        0x4801E000UL
#define MF_BASE                         0x48018000UL
#define ADC2_BASE                       0x4801C000UL
#define ADC1_BASE                       0x40004000UL
#define BDRV_BASE                       0x40034000UL
#define MON_BASE                        0x50004000UL
#define CSA_BASE                        0x48018000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define SCU                             ((SCU_Type                *) SCU_BASE)
#define PORT                            ((PORT_Type               *) PORT_BASE)
#define GPT12E                          ((GPT12E_Type             *) GPT12E_BASE)
#define TIMER2                          ((TIMER2x_Type            *) TIMER2_BASE)
#define TIMER21                         ((TIMER2x_Type            *) TIMER21_BASE)
#define CCU6                            ((CCU6_Type               *) CCU6_BASE)
#define UART1                           ((UART_Type               *) UART1_BASE)
#define UART2                           ((UART_Type               *) UART2_BASE)
#define SSC1                            ((SSC_Type                *) SSC1_BASE)
#define SSC2                            ((SSC_Type                *) SSC2_BASE)
#define PMU                             ((PMU_Type                *) PMU_BASE)
#define SCUPM                           ((SCUPM_Type              *) SCUPM_BASE)
#define CPU                             ((CPU_Type                *) CPU_BASE)
#define DMA                             ((DMA_Type                *) DMA_BASE)
#define TIMER3                          ((TIMER3_Type             *) TIMER3_BASE)
#define LIN                             ((LIN_Type                *) LIN_BASE)
#define MF                              ((MF_Type                 *) MF_BASE)
#define ADC2                            ((ADC2_Type               *) ADC2_BASE)
#define ADC1                            ((ADC1_Type               *) ADC1_BASE)
#define BDRV                            ((BDRV_Type               *) BDRV_BASE)
#define MON                             ((MON_Type                *) MON_BASE)
#define CSA                             ((CSA_Type                *) CSA_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group TLE987x */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* TLE987x_H */

